<?php
//======================================
// 北京市
$cities['110000'] = ['北京', 'B'];
// 北京
$cities['110100'] = ['东城区', 'D'];
$cities['110200'] = ['西城区', 'X'];
$cities['110300'] = ['崇文区', 'C'];
$cities['110400'] = ['宣武区', 'X'];
$cities['110500'] = ['朝阳区', 'C'];
$cities['110600'] = ['丰台区', 'F'];
$cities['110700'] = ['石景山区', 'S'];
$cities['110800'] = ['海淀区', 'H'];
$cities['110900'] = ['门头沟区', 'M'];
$cities['111100'] = ['房山区', 'F'];
$cities['111200'] = ['通州区', 'T'];
$cities['111300'] = ['顺义区', 'S'];
$cities['111400'] = ['昌平区', 'C'];
$cities['111500'] = ['大兴区', 'D'];
$cities['111600'] = ['怀柔区', 'H'];
$cities['111700'] = ['平谷区', 'P'];
$cities['112800'] = ['密云县', 'M'];
$cities['112900'] = ['延庆县', 'Y'];
// 北京市结束
//======================================
// 天津市
$cities['120000'] = ['天津', 'T'];
// 天津
$cities['120100'] = ['和平区', 'H'];
$cities['120200'] = ['河东区', 'H'];
$cities['120300'] = ['河西区', 'H'];
$cities['120400'] = ['南开区', 'N'];
$cities['120500'] = ['河北区', 'H'];
$cities['120600'] = ['红桥区', 'H'];
$cities['120700'] = ['塘沽区', 'T'];
$cities['120800'] = ['汉沽区', 'H'];
$cities['120900'] = ['大港区', 'D'];
$cities['121000'] = ['东丽区', 'D'];
$cities['121100'] = ['西青区', 'X'];
$cities['121200'] = ['津南区', 'J'];
$cities['121300'] = ['北辰区', 'B'];
$cities['121400'] = ['武清区', 'W'];
$cities['121500'] = ['宝坻区', 'B'];
$cities['122100'] = ['宁河县', 'N'];
$cities['122300'] = ['静海县', 'J'];
$cities['122500'] = ['蓟县', 'J'];
$cities['121600'] = ['滨海新区', 'B'];
// 天津市结束
//======================================
// 河北省
$cities['130000'] = ['河北省', 'H'];
// 石家庄
$cities['130100'] = ['石家庄', 'S'];
$cities['130102'] = ['长安区', 'C'];
$cities['130103'] = ['桥东区', 'Q'];
$cities['130104'] = ['桥西区', 'Q'];
$cities['130105'] = ['新华区', 'X'];
$cities['130107'] = ['井陉矿区', 'J'];
$cities['130108'] = ['裕华区', 'Y'];
$cities['130121'] = ['井陉县', 'J'];
$cities['130123'] = ['正定县', 'Z'];
$cities['130124'] = ['栾城县', 'C'];
$cities['130125'] = ['行唐县', 'X'];
$cities['130126'] = ['灵寿县', 'L'];
$cities['130127'] = ['高邑县', 'G'];
$cities['130128'] = ['深泽县', 'S'];
$cities['130129'] = ['赞皇县', 'Z'];
$cities['130130'] = ['无极县', 'W'];
$cities['130131'] = ['平山县', 'P'];
$cities['130132'] = ['元氏县', 'Y'];
$cities['130133'] = ['赵县', 'Z'];
$cities['130181'] = ['辛集市', 'X'];
$cities['130182'] = ['藁城市', 'C'];
$cities['130183'] = ['晋州市', 'J'];
$cities['130184'] = ['新乐市', 'X'];
$cities['130185'] = ['鹿泉市', 'L'];
// 唐山
$cities['130200'] = ['唐山', 'T'];
$cities['130202'] = ['路南区', 'L'];
$cities['130203'] = ['路北区', 'L'];
$cities['130204'] = ['古冶区', 'G'];
$cities['130205'] = ['开平区', 'K'];
$cities['130207'] = ['丰南区', 'F'];
$cities['130208'] = ['丰润区', 'F'];
$cities['130223'] = ['滦县', 'L'];
$cities['130224'] = ['滦南县', 'L'];
$cities['130225'] = ['乐亭县', 'L'];
$cities['130227'] = ['迁西县', 'Q'];
$cities['130229'] = ['玉田县', 'Y'];
$cities['130230'] = ['唐海县', 'T'];
$cities['130281'] = ['遵化市', 'Z'];
$cities['130283'] = ['迁安市', 'Q'];
// 秦皇岛
$cities['130300'] = ['秦皇岛', 'Q'];
$cities['130302'] = ['海港区', 'H'];
$cities['130303'] = ['山海关区', 'S'];
$cities['130304'] = ['北戴河区', 'B'];
$cities['130321'] = ['青龙满族自治县', 'Q'];
$cities['130322'] = ['昌黎县', 'C'];
$cities['130323'] = ['抚宁县', 'F'];
$cities['130324'] = ['卢龙县', 'L'];
// 邯郸
$cities['130400'] = ['邯郸', 'H'];
$cities['130402'] = ['邯山区', 'H'];
$cities['130403'] = ['丛台区', 'C'];
$cities['130404'] = ['复兴区', 'F'];
$cities['130406'] = ['峰峰矿区', 'F'];
$cities['130421'] = ['邯郸县', 'H'];
$cities['130423'] = ['临漳县', 'L'];
$cities['130424'] = ['成安县', 'C'];
$cities['130425'] = ['大名县', 'D'];
$cities['130426'] = ['涉县', 'S'];
$cities['130427'] = ['磁县', 'C'];
$cities['130428'] = ['肥乡县', 'F'];
$cities['130429'] = ['永年县', 'Y'];
$cities['130430'] = ['邱县', 'Q'];
$cities['130431'] = ['鸡泽县', 'J'];
$cities['130432'] = ['广平县', 'G'];
$cities['130433'] = ['馆陶县', 'G'];
$cities['130434'] = ['魏县', 'W'];
$cities['130435'] = ['曲周县', 'Q'];
$cities['130481'] = ['武安市', 'W'];
// 邢台
$cities['130500'] = ['邢台', 'X'];
$cities['130502'] = ['桥东区', 'Q'];
$cities['130503'] = ['桥西区', 'Q'];
$cities['130521'] = ['邢台县', 'X'];
$cities['130522'] = ['临城县', 'L'];
$cities['130523'] = ['内丘县', 'N'];
$cities['130524'] = ['柏乡县', 'B'];
$cities['130525'] = ['隆尧县', 'L'];
$cities['130526'] = ['任县', 'R'];
$cities['130527'] = ['南和县', 'N'];
$cities['130528'] = ['宁晋县', 'N'];
$cities['130529'] = ['巨鹿县', 'J'];
$cities['130530'] = ['新河县', 'X'];
$cities['130531'] = ['广宗县', 'G'];
$cities['130532'] = ['平乡县', 'P'];
$cities['130533'] = ['威县', 'W'];
$cities['130534'] = ['清河县', 'Q'];
$cities['130535'] = ['临西县', 'L'];
$cities['130581'] = ['南宫市', 'N'];
$cities['130582'] = ['沙河市', 'S'];
// 保定
$cities['130600'] = ['保定', 'B'];
$cities['130602'] = ['新市区', 'X'];
$cities['130603'] = ['北市区', 'B'];
$cities['130604'] = ['南市区', 'N'];
$cities['130621'] = ['满城县', 'M'];
$cities['130622'] = ['清苑县', 'Q'];
$cities['130623'] = ['涞水县', 'S'];
$cities['130624'] = ['阜平县', 'F'];
$cities['130625'] = ['徐水县', 'X'];
$cities['130626'] = ['定兴县', 'D'];
$cities['130627'] = ['唐县', 'T'];
$cities['130628'] = ['高阳县', 'G'];
$cities['130629'] = ['容城县', 'R'];
$cities['130630'] = ['涞源县', 'Y'];
$cities['130631'] = ['望都县', 'W'];
$cities['130632'] = ['安新县', 'A'];
$cities['130633'] = ['易县', 'Y'];
$cities['130634'] = ['曲阳县', 'Q'];
$cities['130635'] = ['蠡县', 'X'];
$cities['130636'] = ['顺平县', 'S'];
$cities['130637'] = ['博野县', 'B'];
$cities['130638'] = ['雄县', 'X'];
$cities['130681'] = ['涿州市', 'Z'];
$cities['130682'] = ['定州市', 'D'];
$cities['130683'] = ['安国市', 'A'];
$cities['130684'] = ['高碑店市', 'G'];
// 张家口
$cities['130700'] = ['张家口', 'Z'];
$cities['130702'] = ['桥东区', 'Q'];
$cities['130703'] = ['桥西区', 'Q'];
$cities['130705'] = ['宣化区', 'X'];
$cities['130706'] = ['下花园区', 'X'];
$cities['130721'] = ['宣化县', 'X'];
$cities['130722'] = ['张北县', 'Z'];
$cities['130723'] = ['康保县', 'K'];
$cities['130724'] = ['沽源县', 'G'];
$cities['130725'] = ['尚义县', 'S'];
$cities['130726'] = ['蔚县', 'W'];
$cities['130727'] = ['阳原县', 'Y'];
$cities['130728'] = ['怀安县', 'H'];
$cities['130729'] = ['万全县', 'W'];
$cities['130730'] = ['怀来县', 'H'];
$cities['130731'] = ['涿鹿县', 'L'];
$cities['130732'] = ['赤城县', 'C'];
$cities['130733'] = ['崇礼县', 'C'];
// 承德
$cities['130800'] = ['承德', 'C'];
$cities['130802'] = ['双桥区', 'S'];
$cities['130803'] = ['双滦区', 'S'];
$cities['130804'] = ['鹰手营子矿区', 'Y'];
$cities['130821'] = ['承德县', 'C'];
$cities['130822'] = ['兴隆县', 'X'];
$cities['130823'] = ['平泉县', 'P'];
$cities['130824'] = ['滦平县', 'L'];
$cities['130825'] = ['隆化县', 'L'];
$cities['130826'] = ['丰宁满族自治县', 'F'];
$cities['130827'] = ['宽城满族自治县', 'K'];
$cities['130828'] = ['围场满族蒙古族自治县', 'W'];
// 沧州
$cities['130900'] = ['沧州', 'C'];
$cities['130902'] = ['新华区', 'X'];
$cities['130903'] = ['运河区', 'Y'];
$cities['130921'] = ['沧县', 'C'];
$cities['130922'] = ['青县', 'Q'];
$cities['130923'] = ['东光县', 'D'];
$cities['130924'] = ['海兴县', 'H'];
$cities['130925'] = ['盐山县', 'Y'];
$cities['130926'] = ['肃宁县', 'S'];
$cities['130927'] = ['南皮县', 'N'];
$cities['130928'] = ['吴桥县', 'W'];
$cities['130929'] = ['献县', 'X'];
$cities['130930'] = ['孟村回族自治县', 'M'];
$cities['130981'] = ['泊头市', 'B'];
$cities['130982'] = ['任丘市', 'R'];
$cities['130983'] = ['黄骅市', 'H'];
$cities['130984'] = ['河间市', 'H'];
// 廊坊
$cities['131000'] = ['廊坊', 'L'];
$cities['131002'] = ['安次区', 'A'];
$cities['131003'] = ['广阳区', 'G'];
$cities['131022'] = ['固安县', 'G'];
$cities['131023'] = ['永清县', 'Y'];
$cities['131024'] = ['香河县', 'X'];
$cities['131025'] = ['大城县', 'D'];
$cities['131026'] = ['文安县', 'W'];
$cities['131028'] = ['大厂回族自治县', 'D'];
$cities['131081'] = ['霸州市', 'B'];
$cities['131082'] = ['三河市', 'S'];
// 衡水
$cities['131100'] = ['衡水', 'H'];
$cities['131102'] = ['桃城区', 'T'];
$cities['131121'] = ['枣强县', 'Z'];
$cities['131122'] = ['武邑县', 'W'];
$cities['131123'] = ['武强县', 'W'];
$cities['131124'] = ['饶阳县', 'R'];
$cities['131125'] = ['安平县', 'A'];
$cities['131126'] = ['故城县', 'G'];
$cities['131127'] = ['景县', 'J'];
$cities['131128'] = ['阜城县', 'F'];
$cities['131181'] = ['冀州市', 'J'];
$cities['131182'] = ['深州市', 'S'];
// 河北省结束
//======================================
// 山西省
$cities['140000'] = ['山西省', 'S'];
// 太原
$cities['140100'] = ['太原', 'T'];
$cities['140105'] = ['小店区', 'X'];
$cities['140106'] = ['迎泽区', 'Y'];
$cities['140107'] = ['杏花岭区', 'X'];
$cities['140108'] = ['尖草坪区', 'J'];
$cities['140109'] = ['万柏林区', 'W'];
$cities['140110'] = ['晋源区', 'J'];
$cities['140121'] = ['清徐县', 'Q'];
$cities['140122'] = ['阳曲县', 'Y'];
$cities['140123'] = ['娄烦县', 'L'];
$cities['140181'] = ['古交市', 'G'];
// 大同
$cities['140200'] = ['大同', 'D'];
$cities['140202'] = ['城区', 'C'];
$cities['140203'] = ['矿区', 'K'];
$cities['140211'] = ['南郊区', 'N'];
$cities['140212'] = ['新荣区', 'X'];
$cities['140221'] = ['阳高县', 'Y'];
$cities['140222'] = ['天镇县', 'T'];
$cities['140223'] = ['广灵县', 'G'];
$cities['140224'] = ['灵丘县', 'L'];
$cities['140225'] = ['浑源县', 'H'];
$cities['140226'] = ['左云县', 'Z'];
$cities['140227'] = ['大同县', 'D'];
// 阳泉
$cities['140300'] = ['阳泉', 'Y'];
$cities['140302'] = ['城区', 'C'];
$cities['140303'] = ['矿区', 'K'];
$cities['140311'] = ['郊区', 'J'];
$cities['140321'] = ['平定县', 'P'];
$cities['140322'] = ['盂县', 'Y'];
// 长治
$cities['140400'] = ['长治', 'C'];
$cities['140402'] = ['城区', 'C'];
$cities['140411'] = ['郊区', 'J'];
$cities['140421'] = ['长治县', 'C'];
$cities['140423'] = ['襄垣县', 'X'];
$cities['140424'] = ['屯留县', 'T'];
$cities['140425'] = ['平顺县', 'P'];
$cities['140426'] = ['黎城县', 'L'];
$cities['140427'] = ['壶关县', 'H'];
$cities['140428'] = ['长子县', 'C'];
$cities['140429'] = ['武乡县', 'W'];
$cities['140430'] = ['沁县', 'Q'];
$cities['140431'] = ['沁源县', 'Q'];
$cities['140481'] = ['潞城市', 'L'];
// 晋城
$cities['140500'] = ['晋城', 'J'];
$cities['140502'] = ['城区', 'C'];
$cities['140521'] = ['沁水县', 'Q'];
$cities['140522'] = ['阳城县', 'Y'];
$cities['140524'] = ['陵川县', 'L'];
$cities['140525'] = ['泽州县', 'Z'];
$cities['140581'] = ['高平市', 'G'];
// 朔州
$cities['140600'] = ['朔州', 'S'];
$cities['140602'] = ['朔城区', 'S'];
$cities['140603'] = ['平鲁区', 'P'];
$cities['140621'] = ['山阴县', 'S'];
$cities['140622'] = ['应县', 'Y'];
$cities['140623'] = ['右玉县', 'Y'];
$cities['140624'] = ['怀仁县', 'H'];
// 晋中
$cities['140700'] = ['晋中', 'J'];
$cities['140702'] = ['榆次区', 'Y'];
$cities['140721'] = ['榆社县', 'Y'];
$cities['140722'] = ['左权县', 'Z'];
$cities['140723'] = ['和顺县', 'H'];
$cities['140724'] = ['昔阳县', 'X'];
$cities['140725'] = ['寿阳县', 'S'];
$cities['140726'] = ['太谷县', 'T'];
$cities['140727'] = ['祁县', 'Q'];
$cities['140728'] = ['平遥县', 'P'];
$cities['140729'] = ['灵石县', 'L'];
$cities['140781'] = ['介休市', 'J'];
// 运城
$cities['140800'] = ['运城', 'Y'];
$cities['140802'] = ['盐湖区', 'Y'];
$cities['140821'] = ['临猗县', 'L'];
$cities['140822'] = ['万荣县', 'W'];
$cities['140823'] = ['闻喜县', 'W'];
$cities['140824'] = ['稷山县', 'S'];
$cities['140825'] = ['新绛县', 'X'];
$cities['140826'] = ['绛县', 'X'];
$cities['140827'] = ['垣曲县', 'Y'];
$cities['140828'] = ['夏县', 'X'];
$cities['140829'] = ['平陆县', 'P'];
$cities['140830'] = ['芮城县', 'C'];
$cities['140881'] = ['永济市', 'Y'];
$cities['140882'] = ['河津市', 'H'];
// 忻州
$cities['140900'] = ['忻州', 'X'];
$cities['140902'] = ['忻府区', 'X'];
$cities['140921'] = ['定襄县', 'D'];
$cities['140922'] = ['五台县', 'W'];
$cities['140923'] = ['代县', 'D'];
$cities['140924'] = ['繁峙县', 'F'];
$cities['140925'] = ['宁武县', 'N'];
$cities['140926'] = ['静乐县', 'J'];
$cities['140927'] = ['神池县', 'S'];
$cities['140928'] = ['五寨县', 'W'];
$cities['140929'] = ['岢岚县', 'X'];
$cities['140930'] = ['河曲县', 'H'];
$cities['140931'] = ['保德县', 'B'];
$cities['140932'] = ['偏关县', 'P'];
$cities['140981'] = ['原平市', 'Y'];
// 临汾
$cities['141000'] = ['临汾', 'L'];
$cities['141002'] = ['尧都区', 'Y'];
$cities['141021'] = ['曲沃县', 'Q'];
$cities['141022'] = ['翼城县', 'Y'];
$cities['141023'] = ['襄汾县', 'X'];
$cities['141024'] = ['洪洞县', 'H'];
$cities['141025'] = ['古县', 'G'];
$cities['141026'] = ['安泽县', 'A'];
$cities['141027'] = ['浮山县', 'F'];
$cities['141028'] = ['吉县', 'J'];
$cities['141029'] = ['乡宁县', 'X'];
$cities['141030'] = ['大宁县', 'D'];
$cities['141031'] = ['隰县', 'X'];
$cities['141032'] = ['永和县', 'Y'];
$cities['141033'] = ['蒲县', 'P'];
$cities['141034'] = ['汾西县', 'F'];
$cities['141081'] = ['侯马市', 'H'];
$cities['141082'] = ['霍州市', 'H'];
// 吕梁
$cities['141100'] = ['吕梁', 'L'];
$cities['141102'] = ['离石区', 'L'];
$cities['141121'] = ['文水县', 'W'];
$cities['141122'] = ['交城县', 'J'];
$cities['141123'] = ['兴县', 'X'];
$cities['141124'] = ['临县', 'L'];
$cities['141125'] = ['柳林县', 'L'];
$cities['141126'] = ['石楼县', 'S'];
$cities['141127'] = ['岚县', 'X'];
$cities['141128'] = ['方山县', 'F'];
$cities['141129'] = ['中阳县', 'Z'];
$cities['141130'] = ['交口县', 'J'];
$cities['141181'] = ['孝义市', 'X'];
$cities['141182'] = ['汾阳市', 'F'];
// 山西省结束
//======================================
// 内蒙古
$cities['150000'] = ['内蒙古', 'N'];
// 呼和浩特
$cities['150100'] = ['呼和浩特', 'H'];
$cities['150102'] = ['新城区', 'X'];
$cities['150103'] = ['回民区', 'H'];
$cities['150104'] = ['玉泉区', 'Y'];
$cities['150105'] = ['赛罕区', 'S'];
$cities['150121'] = ['土默特左旗', 'T'];
$cities['150122'] = ['托克托县', 'T'];
$cities['150123'] = ['和林格尔县', 'H'];
$cities['150124'] = ['清水河县', 'Q'];
$cities['150125'] = ['武川县', 'W'];
// 包头
$cities['150200'] = ['包头', 'B'];
$cities['150202'] = ['东河区', 'D'];
$cities['150203'] = ['昆都仑区', 'K'];
$cities['150204'] = ['青山区', 'Q'];
$cities['150205'] = ['石拐区', 'S'];
$cities['150206'] = ['白云矿区', 'B'];
$cities['150207'] = ['九原区', 'J'];
$cities['150221'] = ['土默特右旗', 'T'];
$cities['150222'] = ['固阳县', 'G'];
$cities['150223'] = ['达尔罕茂明安联合旗', 'D'];
// 乌海
$cities['150300'] = ['乌海', 'W'];
$cities['150302'] = ['海勃湾区', 'H'];
$cities['150303'] = ['海南区', 'H'];
$cities['150304'] = ['乌达区', 'W'];
// 赤峰
$cities['150400'] = ['赤峰', 'C'];
$cities['150402'] = ['红山区', 'H'];
$cities['150403'] = ['元宝山区', 'Y'];
$cities['150404'] = ['松山区', 'S'];
$cities['150421'] = ['阿鲁科尔沁旗', 'A'];
$cities['150422'] = ['巴林左旗', 'B'];
$cities['150423'] = ['巴林右旗', 'B'];
$cities['150424'] = ['林西县', 'L'];
$cities['150425'] = ['克什克腾旗', 'K'];
$cities['150426'] = ['翁牛特旗', 'W'];
$cities['150428'] = ['喀喇沁旗', 'K'];
$cities['150429'] = ['宁城县', 'N'];
$cities['150430'] = ['敖汉旗', 'A'];
// 通辽
$cities['150500'] = ['通辽', 'T'];
$cities['150502'] = ['科尔沁区', 'K'];
$cities['150521'] = ['科尔沁左翼中旗', 'K'];
$cities['150522'] = ['科尔沁左翼后旗', 'K'];
$cities['150523'] = ['开鲁县', 'K'];
$cities['150524'] = ['库伦旗', 'K'];
$cities['150525'] = ['奈曼旗', 'N'];
$cities['150526'] = ['扎鲁特旗', 'Z'];
$cities['150581'] = ['霍林郭勒市', 'H'];
// 鄂尔多斯
$cities['150600'] = ['鄂尔多斯', 'E'];
$cities['150602'] = ['东胜区', 'D'];
$cities['150621'] = ['达拉特旗', 'D'];
$cities['150622'] = ['准格尔旗', 'Z'];
$cities['150623'] = ['鄂托克前旗', 'E'];
$cities['150624'] = ['鄂托克旗', 'E'];
$cities['150625'] = ['杭锦旗', 'H'];
$cities['150626'] = ['乌审旗', 'W'];
$cities['150627'] = ['伊金霍洛旗', 'Y'];
// 呼伦贝尔
$cities['150700'] = ['呼伦贝尔', 'H'];
$cities['150702'] = ['海拉尔区', 'H'];
$cities['150721'] = ['阿荣旗', 'A'];
$cities['150722'] = ['莫力达瓦达斡尔族自治旗', 'M'];
$cities['150723'] = ['鄂伦春自治旗', 'E'];
$cities['150724'] = ['鄂温克族自治旗', 'E'];
$cities['150725'] = ['陈巴尔虎旗', 'C'];
$cities['150726'] = ['新巴尔虎左旗', 'X'];
$cities['150727'] = ['新巴尔虎右旗', 'X'];
$cities['150781'] = ['满洲里市', 'M'];
$cities['150782'] = ['牙克石市', 'Y'];
$cities['150783'] = ['扎兰屯市', 'Z'];
$cities['150784'] = ['额尔古纳市', 'E'];
$cities['150785'] = ['根河市', 'G'];
// 巴彦淖尔
$cities['150800'] = ['巴彦淖尔', 'B'];
$cities['150802'] = ['临河区', 'L'];
$cities['150821'] = ['五原县', 'W'];
$cities['150822'] = ['磴口县', 'K'];
$cities['150823'] = ['乌拉特前旗', 'W'];
$cities['150824'] = ['乌拉特中旗', 'W'];
$cities['150825'] = ['乌拉特后旗', 'W'];
$cities['150826'] = ['杭锦后旗', 'H'];
// 乌兰察布
$cities['150900'] = ['乌兰察布', 'W'];
$cities['150902'] = ['集宁区', 'J'];
$cities['150921'] = ['卓资县', 'Z'];
$cities['150922'] = ['化德县', 'H'];
$cities['150923'] = ['商都县', 'S'];
$cities['150924'] = ['兴和县', 'X'];
$cities['150925'] = ['凉城县', 'L'];
$cities['150926'] = ['察哈尔右翼前旗', 'C'];
$cities['150927'] = ['察哈尔右翼中旗', 'C'];
$cities['150928'] = ['察哈尔右翼后旗', 'C'];
$cities['150929'] = ['四子王旗', 'S'];
$cities['150981'] = ['丰镇市', 'F'];
// 兴安盟
$cities['152200'] = ['兴安盟', 'X'];
$cities['152201'] = ['乌兰浩特市', 'W'];
$cities['152202'] = ['阿尔山市', 'A'];
$cities['152221'] = ['科尔沁右翼前旗', 'K'];
$cities['152222'] = ['科尔沁右翼中旗', 'K'];
$cities['152223'] = ['扎赉特旗', 'Z'];
$cities['152224'] = ['突泉县', 'T'];
// 锡林郭勒
$cities['152500'] = ['锡林郭勒', 'X'];
$cities['152501'] = ['二连浩特市', 'E'];
$cities['152502'] = ['锡林浩特市', 'X'];
$cities['152522'] = ['阿巴嘎旗', 'A'];
$cities['152523'] = ['苏尼特左旗', 'S'];
$cities['152524'] = ['苏尼特右旗', 'S'];
$cities['152525'] = ['东乌珠穆沁旗', 'D'];
$cities['152526'] = ['西乌珠穆沁旗', 'X'];
$cities['152527'] = ['太仆寺旗', 'T'];
$cities['152528'] = ['镶黄旗', 'X'];
$cities['152529'] = ['正镶白旗', 'Z'];
$cities['152530'] = ['正蓝旗', 'Z'];
$cities['152531'] = ['多伦县', 'D'];
// 阿拉善
$cities['152900'] = ['阿拉善', 'A'];
$cities['152921'] = ['阿拉善左旗', 'A'];
$cities['152922'] = ['阿拉善右旗', 'A'];
$cities['152923'] = ['额济纳旗', 'E'];
// 内蒙古结束
//======================================
// 辽宁省
$cities['210000'] = ['辽宁省', 'L'];
// 沈阳
$cities['210100'] = ['沈阳', 'S'];
$cities['210102'] = ['和平区', 'H'];
$cities['210103'] = ['沈河区', 'S'];
$cities['210104'] = ['大东区', 'D'];
$cities['210105'] = ['皇姑区', 'H'];
$cities['210106'] = ['铁西区', 'T'];
$cities['210111'] = ['苏家屯区', 'S'];
$cities['210112'] = ['东陵区', 'D'];
$cities['210113'] = ['沈北新区', 'S'];
$cities['210114'] = ['于洪区', 'Y'];
$cities['210122'] = ['辽中县', 'L'];
$cities['210123'] = ['康平县', 'K'];
$cities['210124'] = ['法库县', 'F'];
$cities['210181'] = ['新民市', 'X'];
// 大连
$cities['210200'] = ['大连', 'D'];
$cities['210202'] = ['中山区', 'Z'];
$cities['210203'] = ['西岗区', 'X'];
$cities['210204'] = ['沙河口区', 'S'];
$cities['210211'] = ['甘井子区', 'G'];
$cities['210212'] = ['旅顺口区', 'L'];
$cities['210213'] = ['金州区', 'J'];
$cities['210224'] = ['长海县', 'C'];
$cities['210281'] = ['瓦房店市', 'W'];
$cities['210282'] = ['普兰店市', 'P'];
$cities['210283'] = ['庄河市', 'Z'];
// 鞍山
$cities['210300'] = ['鞍山', 'A'];
$cities['210302'] = ['铁东区', 'T'];
$cities['210303'] = ['铁西区', 'T'];
$cities['210304'] = ['立山区', 'L'];
$cities['210311'] = ['千山区', 'Q'];
$cities['210321'] = ['台安县', 'T'];
$cities['210323'] = ['岫岩满族自治县', 'Y'];
$cities['210381'] = ['海城市', 'H'];
// 抚顺
$cities['210400'] = ['抚顺', 'F'];
$cities['210402'] = ['新抚区', 'X'];
$cities['210403'] = ['东洲区', 'D'];
$cities['210404'] = ['望花区', 'W'];
$cities['210411'] = ['顺城区', 'S'];
$cities['210421'] = ['抚顺县', 'F'];
$cities['210422'] = ['新宾满族自治县', 'X'];
$cities['210423'] = ['清原满族自治县', 'Q'];
// 本溪
$cities['210500'] = ['本溪', 'B'];
$cities['210502'] = ['平山区', 'P'];
$cities['210503'] = ['溪湖区', 'X'];
$cities['210504'] = ['明山区', 'M'];
$cities['210505'] = ['南芬区', 'N'];
$cities['210521'] = ['本溪满族自治县', 'B'];
$cities['210522'] = ['桓仁满族自治县', 'H'];
// 丹东
$cities['210600'] = ['丹东', 'D'];
$cities['210602'] = ['元宝区', 'Y'];
$cities['210603'] = ['振兴区', 'Z'];
$cities['210604'] = ['振安区', 'Z'];
$cities['210624'] = ['宽甸满族自治县', 'K'];
$cities['210681'] = ['东港市', 'D'];
$cities['210682'] = ['凤城市', 'F'];
// 锦州
$cities['210700'] = ['锦州', 'J'];
$cities['210702'] = ['古塔区', 'G'];
$cities['210703'] = ['凌河区', 'L'];
$cities['210711'] = ['太和区', 'T'];
$cities['210726'] = ['黑山县', 'H'];
$cities['210727'] = ['义县', 'Y'];
$cities['210781'] = ['凌海市', 'L'];
$cities['210782'] = ['北宁市', 'B'];
// 营口
$cities['210800'] = ['营口', 'Y'];
$cities['210802'] = ['站前区', 'Z'];
$cities['210803'] = ['西市区', 'X'];
$cities['210804'] = ['鲅鱼圈区', 'Y'];
$cities['210811'] = ['老边区', 'L'];
$cities['210881'] = ['盖州市', 'G'];
$cities['210882'] = ['大石桥市', 'D'];
// 阜新
$cities['210900'] = ['阜新', 'F'];
$cities['210902'] = ['海州区', 'H'];
$cities['210903'] = ['新邱区', 'X'];
$cities['210904'] = ['太平区', 'T'];
$cities['210905'] = ['清河门区', 'Q'];
$cities['210911'] = ['细河区', 'X'];
$cities['210921'] = ['阜新蒙古族自治县', 'F'];
$cities['210922'] = ['彰武县', 'Z'];
// 辽阳
$cities['211000'] = ['辽阳', 'L'];
$cities['211002'] = ['白塔区', 'B'];
$cities['211003'] = ['文圣区', 'W'];
$cities['211004'] = ['宏伟区', 'H'];
$cities['211005'] = ['弓长岭区', 'G'];
$cities['211011'] = ['太子河区', 'T'];
$cities['211021'] = ['辽阳县', 'L'];
$cities['211081'] = ['灯塔市', 'D'];
// 盘锦
$cities['211100'] = ['盘锦', 'P'];
$cities['211102'] = ['双台子区', 'S'];
$cities['211103'] = ['兴隆台区', 'X'];
$cities['211121'] = ['大洼县', 'D'];
$cities['211122'] = ['盘山县', 'P'];
// 铁岭
$cities['211200'] = ['铁岭', 'T'];
$cities['211202'] = ['银州区', 'Y'];
$cities['211204'] = ['清河区', 'Q'];
$cities['211221'] = ['铁岭县', 'T'];
$cities['211223'] = ['西丰县', 'X'];
$cities['211224'] = ['昌图县', 'C'];
$cities['211281'] = ['调兵山市', 'D'];
$cities['211282'] = ['开原市', 'K'];
// 朝阳
$cities['211300'] = ['朝阳', 'C'];
$cities['211302'] = ['双塔区', 'S'];
$cities['211303'] = ['龙城区', 'L'];
$cities['211321'] = ['朝阳县', 'C'];
$cities['211322'] = ['建平县', 'J'];
$cities['211324'] = ['喀喇沁左翼蒙古族自治县', 'K'];
$cities['211381'] = ['北票市', 'B'];
$cities['211382'] = ['凌源市', 'L'];
// 葫芦岛
$cities['211400'] = ['葫芦岛', 'H'];
$cities['211402'] = ['连山区', 'L'];
$cities['211403'] = ['龙港区', 'L'];
$cities['211404'] = ['南票区', 'N'];
$cities['211421'] = ['绥中县', 'S'];
$cities['211422'] = ['建昌县', 'J'];
$cities['211481'] = ['兴城市', 'X'];
// 辽宁省结束
//======================================
// 吉林省
$cities['220000'] = ['吉林省', 'J'];
// 长春
$cities['220100'] = ['长春', 'C'];
$cities['220102'] = ['南关区', 'N'];
$cities['220103'] = ['宽城区', 'K'];
$cities['220104'] = ['朝阳区', 'C'];
$cities['220105'] = ['二道区', 'E'];
$cities['220106'] = ['绿园区', 'L'];
$cities['220112'] = ['双阳区', 'S'];
$cities['220122'] = ['农安县', 'N'];
$cities['220181'] = ['九台市', 'J'];
$cities['220182'] = ['榆树市', 'Y'];
$cities['220183'] = ['德惠市', 'D'];
// 吉林
$cities['220200'] = ['吉林', 'J'];
$cities['220202'] = ['昌邑区', 'C'];
$cities['220203'] = ['龙潭区', 'L'];
$cities['220204'] = ['船营区', 'C'];
$cities['220211'] = ['丰满区', 'F'];
$cities['220221'] = ['永吉县', 'Y'];
$cities['220281'] = ['蛟河市', 'H'];
$cities['220282'] = ['桦甸市', 'D'];
$cities['220283'] = ['舒兰市', 'S'];
$cities['220284'] = ['磐石市', 'P'];
// 四平
$cities['220300'] = ['四平', 'S'];
$cities['220302'] = ['铁西区', 'T'];
$cities['220303'] = ['铁东区', 'T'];
$cities['220322'] = ['梨树县', 'L'];
$cities['220323'] = ['伊通满族自治县', 'Y'];
$cities['220381'] = ['公主岭市', 'G'];
$cities['220382'] = ['双辽市', 'S'];
// 辽源
$cities['220400'] = ['辽源', 'L'];
$cities['220402'] = ['龙山区', 'L'];
$cities['220403'] = ['西安区', 'X'];
$cities['220421'] = ['东丰县', 'D'];
$cities['220422'] = ['东辽县', 'D'];
// 通化
$cities['220500'] = ['通化', 'T'];
$cities['220502'] = ['东昌区', 'D'];
$cities['220503'] = ['二道江区', 'E'];
$cities['220521'] = ['通化县', 'T'];
$cities['220523'] = ['辉南县', 'H'];
$cities['220524'] = ['柳河县', 'L'];
$cities['220581'] = ['梅河口市', 'M'];
$cities['220582'] = ['集安市', 'J'];
// 白山
$cities['220600'] = ['白山', 'B'];
$cities['220602'] = ['八道江区', 'B'];
$cities['220621'] = ['抚松县', 'F'];
$cities['220622'] = ['靖宇县', 'J'];
$cities['220623'] = ['长白朝鲜族自治县', 'C'];
$cities['220625'] = ['江源县', 'J'];
$cities['220681'] = ['临江市', 'L'];
// 松原
$cities['220700'] = ['松原', 'S'];
$cities['220702'] = ['宁江区', 'N'];
$cities['220721'] = ['前郭尔罗斯蒙古族自治县', 'Q'];
$cities['220722'] = ['长岭县', 'C'];
$cities['220723'] = ['乾安县', 'Q'];
$cities['220724'] = ['扶余县', 'F'];
// 白城
$cities['220800'] = ['白城', 'B'];
$cities['220802'] = ['洮北区', 'B'];
$cities['220821'] = ['镇赉县', 'Z'];
$cities['220822'] = ['通榆县', 'T'];
$cities['220881'] = ['洮南市', 'N'];
$cities['220882'] = ['大安市', 'D'];
// 延边
$cities['222400'] = ['延边', 'Y'];
$cities['222401'] = ['延吉市', 'Y'];
$cities['222402'] = ['图们市', 'T'];
$cities['222403'] = ['敦化市', 'D'];
$cities['222404'] = ['珲春市', 'C'];
$cities['222405'] = ['龙井市', 'L'];
$cities['222406'] = ['和龙市', 'H'];
$cities['222424'] = ['汪清县', 'W'];
$cities['222426'] = ['安图县', 'A'];
// 吉林省结束
//======================================
// 黑龙江
$cities['230000'] = ['黑龙江', 'H'];
// 哈尔滨
$cities['230100'] = ['哈尔滨', 'H'];
$cities['230102'] = ['道里区', 'D'];
$cities['230103'] = ['南岗区', 'N'];
$cities['230104'] = ['道外区', 'D'];
$cities['230106'] = ['香坊区', 'X'];
$cities['230107'] = ['动力区', 'D'];
$cities['230108'] = ['平房区', 'P'];
$cities['230109'] = ['松北区', 'S'];
$cities['230111'] = ['呼兰区', 'H'];
$cities['230123'] = ['依兰县', 'Y'];
$cities['230124'] = ['方正县', 'F'];
$cities['230125'] = ['宾县', 'B'];
$cities['230126'] = ['巴彦县', 'B'];
$cities['230127'] = ['木兰县', 'M'];
$cities['230128'] = ['通河县', 'T'];
$cities['230129'] = ['延寿县', 'Y'];
$cities['230181'] = ['阿城市', 'A'];
$cities['230182'] = ['双城市', 'S'];
$cities['230183'] = ['尚志市', 'S'];
$cities['230184'] = ['五常市', 'W'];
// 齐齐哈尔
$cities['230200'] = ['齐齐哈尔', 'Q'];
$cities['230202'] = ['龙沙区', 'L'];
$cities['230203'] = ['建华区', 'J'];
$cities['230204'] = ['铁锋区', 'T'];
$cities['230205'] = ['昂昂溪区', 'A'];
$cities['230206'] = ['富拉尔基区', 'F'];
$cities['230207'] = ['碾子山区', 'N'];
$cities['230208'] = ['梅里斯达斡尔族区', 'M'];
$cities['230221'] = ['龙江县', 'L'];
$cities['230223'] = ['依安县', 'Y'];
$cities['230224'] = ['泰来县', 'T'];
$cities['230225'] = ['甘南县', 'G'];
$cities['230227'] = ['富裕县', 'F'];
$cities['230229'] = ['克山县', 'K'];
$cities['230230'] = ['克东县', 'K'];
$cities['230231'] = ['拜泉县', 'B'];
$cities['230281'] = ['讷河市', 'H'];
// 鸡西
$cities['230300'] = ['鸡西', 'J'];
$cities['230302'] = ['鸡冠区', 'J'];
$cities['230303'] = ['恒山区', 'H'];
$cities['230304'] = ['滴道区', 'D'];
$cities['230305'] = ['梨树区', 'L'];
$cities['230306'] = ['城子河区', 'C'];
$cities['230307'] = ['麻山区', 'M'];
$cities['230321'] = ['鸡东县', 'J'];
$cities['230381'] = ['虎林市', 'H'];
$cities['230382'] = ['密山市', 'M'];
// 鹤岗
$cities['230400'] = ['鹤岗', 'H'];
$cities['230402'] = ['向阳区', 'X'];
$cities['230403'] = ['工农区', 'G'];
$cities['230404'] = ['南山区', 'N'];
$cities['230405'] = ['兴安区', 'X'];
$cities['230406'] = ['东山区', 'D'];
$cities['230407'] = ['兴山区', 'X'];
$cities['230421'] = ['萝北县', 'L'];
$cities['230422'] = ['绥滨县', 'S'];
// 双鸭山
$cities['230500'] = ['双鸭山', 'S'];
$cities['230502'] = ['尖山区', 'J'];
$cities['230503'] = ['岭东区', 'L'];
$cities['230505'] = ['四方台区', 'S'];
$cities['230506'] = ['宝山区', 'B'];
$cities['230521'] = ['集贤县', 'J'];
$cities['230522'] = ['友谊县', 'Y'];
$cities['230523'] = ['宝清县', 'B'];
$cities['230524'] = ['饶河县', 'R'];
// 大庆
$cities['230600'] = ['大庆', 'D'];
$cities['230602'] = ['萨尔图区', 'S'];
$cities['230603'] = ['龙凤区', 'L'];
$cities['230604'] = ['让胡路区', 'R'];
$cities['230605'] = ['红岗区', 'H'];
$cities['230606'] = ['大同区', 'D'];
$cities['230621'] = ['肇州县', 'Z'];
$cities['230622'] = ['肇源县', 'Z'];
$cities['230623'] = ['林甸县', 'L'];
$cities['230624'] = ['杜尔伯特蒙古族自治县', 'D'];
// 伊春
$cities['230700'] = ['伊春', 'Y'];
$cities['230702'] = ['伊春区', 'Y'];
$cities['230703'] = ['南岔区', 'N'];
$cities['230704'] = ['友好区', 'Y'];
$cities['230705'] = ['西林区', 'X'];
$cities['230706'] = ['翠峦区', 'C'];
$cities['230707'] = ['新青区', 'X'];
$cities['230708'] = ['美溪区', 'M'];
$cities['230709'] = ['金山屯区', 'J'];
$cities['230710'] = ['五营区', 'W'];
$cities['230711'] = ['乌马河区', 'W'];
$cities['230712'] = ['汤旺河区', 'T'];
$cities['230713'] = ['带岭区', 'D'];
$cities['230714'] = ['乌伊岭区', 'W'];
$cities['230715'] = ['红星区', 'H'];
$cities['230716'] = ['上甘岭区', 'S'];
$cities['230722'] = ['嘉荫县', 'J'];
$cities['230781'] = ['铁力市', 'T'];
// 佳木斯
$cities['230800'] = ['佳木斯', 'J'];
$cities['230802'] = ['永红区', 'Y'];
$cities['230803'] = ['向阳区', 'X'];
$cities['230804'] = ['前进区', 'Q'];
$cities['230805'] = ['东风区', 'D'];
$cities['230811'] = ['郊区', 'J'];
$cities['230822'] = ['桦南县', 'N'];
$cities['230826'] = ['桦川县', 'C'];
$cities['230828'] = ['汤原县', 'T'];
$cities['230833'] = ['抚远县', 'F'];
$cities['230881'] = ['同江市', 'T'];
$cities['230882'] = ['富锦市', 'F'];
// 七台河
$cities['230900'] = ['七台河', 'Q'];
$cities['230902'] = ['新兴区', 'X'];
$cities['230903'] = ['桃山区', 'T'];
$cities['230904'] = ['茄子河区', 'Q'];
$cities['230921'] = ['勃利县', 'B'];
// 牡丹江
$cities['231000'] = ['牡丹江', 'M'];
$cities['231002'] = ['东安区', 'D'];
$cities['231003'] = ['阳明区', 'Y'];
$cities['231004'] = ['爱民区', 'A'];
$cities['231005'] = ['西安区', 'X'];
$cities['231024'] = ['东宁县', 'D'];
$cities['231025'] = ['林口县', 'L'];
$cities['231081'] = ['绥芬河市', 'S'];
$cities['231083'] = ['海林市', 'H'];
$cities['231084'] = ['宁安市', 'N'];
$cities['231085'] = ['穆棱市', 'M'];
// 黑河
$cities['231100'] = ['黑河', 'H'];
$cities['231102'] = ['爱辉区', 'A'];
$cities['231121'] = ['嫩江县', 'N'];
$cities['231123'] = ['逊克县', 'X'];
$cities['231124'] = ['孙吴县', 'S'];
$cities['231181'] = ['北安市', 'B'];
$cities['231182'] = ['五大连池市', 'W'];
// 绥化
$cities['231200'] = ['绥化', 'S'];
$cities['231202'] = ['北林区', 'B'];
$cities['231221'] = ['望奎县', 'W'];
$cities['231222'] = ['兰西县', 'L'];
$cities['231223'] = ['青冈县', 'Q'];
$cities['231224'] = ['庆安县', 'Q'];
$cities['231225'] = ['明水县', 'M'];
$cities['231226'] = ['绥棱县', 'S'];
$cities['231281'] = ['安达市', 'A'];
$cities['231282'] = ['肇东市', 'Z'];
$cities['231283'] = ['海伦市', 'H'];
// 大兴安岭
$cities['232700'] = ['大兴安岭', 'D'];
$cities['232721'] = ['呼玛县', 'H'];
$cities['232722'] = ['塔河县', 'T'];
$cities['232723'] = ['漠河县', 'M'];
// 黑龙江结束
//======================================
// 上海市
$cities['310000'] = ['上海', 'S'];
// 上海
$cities['310100'] = ['黄浦区', 'H'];
$cities['310300'] = ['卢湾区', 'L'];
$cities['310400'] = ['徐汇区', 'X'];
$cities['310500'] = ['长宁区', 'C'];
$cities['310600'] = ['静安区', 'J'];
$cities['310700'] = ['普陀区', 'P'];
$cities['310800'] = ['闸北区', 'Z'];
$cities['310900'] = ['虹口区', 'H'];
$cities['311000'] = ['杨浦区', 'Y'];
$cities['311200'] = ['闵行区', 'X'];
$cities['311300'] = ['宝山区', 'B'];
$cities['311400'] = ['嘉定区', 'J'];
$cities['311500'] = ['浦东新区', 'P'];
$cities['311600'] = ['金山区', 'J'];
$cities['311700'] = ['松江区', 'S'];
$cities['311800'] = ['青浦区', 'Q'];
$cities['311900'] = ['南汇区', 'N'];
$cities['312000'] = ['奉贤区', 'F'];
$cities['313000'] = ['崇明县', 'C'];
// 上海市结束
//======================================
// 江苏省
$cities['320000'] = ['江苏省', 'J'];
// 南京
$cities['320100'] = ['南京', 'N'];
$cities['320102'] = ['玄武区', 'X'];
$cities['320103'] = ['白下区', 'B'];
$cities['320104'] = ['秦淮区', 'Q'];
$cities['320105'] = ['建邺区', 'J'];
$cities['320106'] = ['鼓楼区', 'G'];
$cities['320107'] = ['下关区', 'X'];
$cities['320111'] = ['浦口区', 'P'];
$cities['320113'] = ['栖霞区', 'Q'];
$cities['320114'] = ['雨花台区', 'Y'];
$cities['320115'] = ['江宁区', 'J'];
$cities['320116'] = ['六合区', 'L'];
$cities['320124'] = ['溧水县', 'S'];
$cities['320125'] = ['高淳县', 'G'];
// 无锡
$cities['320200'] = ['无锡', 'W'];
$cities['320202'] = ['崇安区', 'C'];
$cities['320203'] = ['南长区', 'N'];
$cities['320204'] = ['北塘区', 'B'];
$cities['320205'] = ['锡山区', 'X'];
$cities['320206'] = ['惠山区', 'H'];
$cities['320211'] = ['滨湖区', 'B'];
$cities['320281'] = ['江阴市', 'J'];
$cities['320282'] = ['宜兴市', 'Y'];
// 徐州
$cities['320300'] = ['徐州', 'X'];
$cities['320302'] = ['鼓楼区', 'G'];
$cities['320303'] = ['云龙区', 'Y'];
$cities['320304'] = ['九里区', 'J'];
$cities['320305'] = ['贾汪区', 'J'];
$cities['320311'] = ['泉山区', 'Q'];
$cities['320321'] = ['丰县', 'F'];
$cities['320322'] = ['沛县', 'P'];
$cities['320323'] = ['铜山县', 'T'];
$cities['320324'] = ['睢宁县', 'N'];
$cities['320381'] = ['新沂市', 'X'];
$cities['320382'] = ['邳州市', 'Z'];
// 常州
$cities['320400'] = ['常州', 'C'];
$cities['320402'] = ['天宁区', 'T'];
$cities['320404'] = ['钟楼区', 'Z'];
$cities['320405'] = ['戚墅堰区', 'Q'];
$cities['320411'] = ['新北区', 'X'];
$cities['320412'] = ['武进区', 'W'];
$cities['320481'] = ['溧阳市', 'Y'];
$cities['320482'] = ['金坛市', 'J'];
// 苏州
$cities['320500'] = ['苏州', 'S'];
$cities['320502'] = ['沧浪区', 'C'];
$cities['320503'] = ['平江区', 'P'];
$cities['320504'] = ['金阊区', 'J'];
$cities['320505'] = ['虎丘区', 'H'];
$cities['320506'] = ['吴中区', 'W'];
$cities['320507'] = ['相城区', 'X'];
$cities['320581'] = ['常熟市', 'C'];
$cities['320582'] = ['张家港市', 'Z'];
$cities['320583'] = ['昆山市', 'K'];
$cities['320584'] = ['吴江市', 'W'];
$cities['320585'] = ['太仓市', 'T'];
// 南通
$cities['320600'] = ['南通', 'N'];
$cities['320602'] = ['崇川区', 'C'];
$cities['320611'] = ['港闸区', 'G'];
$cities['320621'] = ['海安县', 'H'];
$cities['320623'] = ['如东县', 'R'];
$cities['320681'] = ['启东市', 'Q'];
$cities['320682'] = ['如皋市', 'R'];
$cities['320683'] = ['通州市', 'T'];
$cities['320684'] = ['海门市', 'H'];
// 连云港
$cities['320700'] = ['连云港', 'L'];
$cities['320703'] = ['连云区', 'L'];
$cities['320705'] = ['新浦区', 'X'];
$cities['320706'] = ['海州区', 'H'];
$cities['320721'] = ['赣榆县', 'G'];
$cities['320722'] = ['东海县', 'D'];
$cities['320723'] = ['灌云县', 'G'];
$cities['320724'] = ['灌南县', 'G'];
// 淮安
$cities['320800'] = ['淮安', 'H'];
$cities['320802'] = ['清河区', 'Q'];
$cities['320803'] = ['楚州区', 'C'];
$cities['320804'] = ['淮阴区', 'H'];
$cities['320811'] = ['清浦区', 'Q'];
$cities['320826'] = ['涟水县', 'L'];
$cities['320829'] = ['洪泽县', 'H'];
$cities['320830'] = ['盱眙县', 'X'];
$cities['320831'] = ['金湖县', 'J'];
// 盐城
$cities['320900'] = ['盐城', 'Y'];
$cities['320902'] = ['亭湖区', 'T'];
$cities['320903'] = ['盐都区', 'Y'];
$cities['320921'] = ['响水县', 'X'];
$cities['320922'] = ['滨海县', 'B'];
$cities['320923'] = ['阜宁县', 'F'];
$cities['320924'] = ['射阳县', 'S'];
$cities['320925'] = ['建湖县', 'J'];
$cities['320981'] = ['东台市', 'D'];
$cities['320982'] = ['大丰市', 'D'];
// 扬州
$cities['321000'] = ['扬州', 'Y'];
$cities['321002'] = ['广陵区', 'G'];
$cities['321003'] = ['邗江区', 'J'];
$cities['321011'] = ['郊区', 'J'];
$cities['321023'] = ['宝应县', 'B'];
$cities['321081'] = ['仪征市', 'Y'];
$cities['321084'] = ['高邮市', 'G'];
$cities['321088'] = ['江都市', 'J'];
// 镇江
$cities['321100'] = ['镇江', 'Z'];
$cities['321102'] = ['京口区', 'J'];
$cities['321111'] = ['润州区', 'R'];
$cities['321112'] = ['丹徒区', 'D'];
$cities['321181'] = ['丹阳市', 'D'];
$cities['321182'] = ['扬中市', 'Y'];
$cities['321183'] = ['句容市', 'J'];
// 泰州
$cities['321200'] = ['泰州', 'T'];
$cities['321202'] = ['海陵区', 'H'];
$cities['321203'] = ['高港区', 'G'];
$cities['321281'] = ['兴化市', 'X'];
$cities['321282'] = ['靖江市', 'J'];
$cities['321283'] = ['泰兴市', 'T'];
$cities['321284'] = ['姜堰市', 'J'];
// 宿迁
$cities['321300'] = ['宿迁', 'S'];
$cities['321302'] = ['宿城区', 'S'];
$cities['321311'] = ['宿豫区', 'S'];
$cities['321322'] = ['沭阳县', 'Y'];
$cities['321323'] = ['泗阳县', 'Y'];
$cities['321324'] = ['泗洪县', 'H'];
// 江苏省结束
//======================================
// 浙江省
$cities['330000'] = ['浙江省', 'Z'];
// 杭州
$cities['330100'] = ['杭州', 'H'];
$cities['330102'] = ['上城区', 'S'];
$cities['330103'] = ['下城区', 'X'];
$cities['330104'] = ['江干区', 'J'];
$cities['330105'] = ['拱墅区', 'G'];
$cities['330106'] = ['西湖区', 'X'];
$cities['330108'] = ['滨江区', 'B'];
$cities['330109'] = ['萧山区', 'X'];
$cities['330110'] = ['余杭区', 'Y'];
$cities['330122'] = ['桐庐县', 'T'];
$cities['330127'] = ['淳安县', 'C'];
$cities['330182'] = ['建德市', 'J'];
$cities['330183'] = ['富阳市', 'F'];
$cities['330185'] = ['临安市', 'L'];
// 宁波
$cities['330200'] = ['宁波', 'N'];
$cities['330203'] = ['海曙区', 'H'];
$cities['330204'] = ['江东区', 'J'];
$cities['330205'] = ['江北区', 'J'];
$cities['330206'] = ['北仑区', 'B'];
$cities['330211'] = ['镇海区', 'Z'];
$cities['330212'] = ['鄞州区', 'Z'];
$cities['330225'] = ['象山县', 'X'];
$cities['330226'] = ['宁海县', 'N'];
$cities['330281'] = ['余姚市', 'Y'];
$cities['330282'] = ['慈溪市', 'C'];
$cities['330283'] = ['奉化市', 'F'];
// 温州
$cities['330300'] = ['温州', 'W'];
$cities['330302'] = ['鹿城区', 'L'];
$cities['330303'] = ['龙湾区', 'L'];
$cities['330304'] = ['瓯海区', 'H'];
$cities['330322'] = ['洞头县', 'D'];
$cities['330324'] = ['永嘉县', 'Y'];
$cities['330326'] = ['平阳县', 'P'];
$cities['330327'] = ['苍南县', 'C'];
$cities['330328'] = ['文成县', 'W'];
$cities['330329'] = ['泰顺县', 'T'];
$cities['330381'] = ['瑞安市', 'R'];
$cities['330382'] = ['乐清市', 'L'];
// 嘉兴
$cities['330400'] = ['嘉兴', 'J'];
$cities['330402'] = ['南湖区', 'N'];
$cities['330411'] = ['秀洲区', 'X'];
$cities['330421'] = ['嘉善县', 'J'];
$cities['330424'] = ['海盐县', 'H'];
$cities['330481'] = ['海宁市', 'H'];
$cities['330482'] = ['平湖市', 'P'];
$cities['330483'] = ['桐乡市', 'T'];
// 湖州
$cities['330500'] = ['湖州', 'H'];
$cities['330502'] = ['吴兴区', 'W'];
$cities['330503'] = ['南浔区', 'N'];
$cities['330521'] = ['德清县', 'D'];
$cities['330522'] = ['长兴县', 'C'];
$cities['330523'] = ['安吉县', 'A'];
// 绍兴
$cities['330600'] = ['绍兴', 'S'];
$cities['330602'] = ['越城区', 'Y'];
$cities['330621'] = ['绍兴县', 'S'];
$cities['330624'] = ['新昌县', 'X'];
$cities['330681'] = ['诸暨市', 'Z'];
$cities['330682'] = ['上虞市', 'S'];
$cities['330683'] = ['嵊州市', 'Z'];
// 金华
$cities['330700'] = ['金华', 'J'];
$cities['330702'] = ['婺城区', 'C'];
$cities['330703'] = ['金东区', 'J'];
$cities['330723'] = ['武义县', 'W'];
$cities['330726'] = ['浦江县', 'P'];
$cities['330727'] = ['磐安县', 'P'];
$cities['330781'] = ['兰溪市', 'L'];
$cities['330782'] = ['义乌市', 'Y'];
$cities['330783'] = ['东阳市', 'D'];
$cities['330784'] = ['永康市', 'Y'];
// 衢州
$cities['330800'] = ['衢州', 'Z'];
$cities['330802'] = ['柯城区', 'K'];
$cities['330803'] = ['衢江区', 'J'];
$cities['330822'] = ['常山县', 'C'];
$cities['330824'] = ['开化县', 'K'];
$cities['330825'] = ['龙游县', 'L'];
$cities['330881'] = ['江山市', 'J'];
// 舟山
$cities['330900'] = ['舟山', 'Z'];
$cities['330902'] = ['定海区', 'D'];
$cities['330903'] = ['普陀区', 'P'];
$cities['330921'] = ['岱山县', 'S'];
$cities['330922'] = ['嵊泗县', 'X'];
// 台州
$cities['331000'] = ['台州', 'T'];
$cities['331002'] = ['椒江区', 'J'];
$cities['331003'] = ['黄岩区', 'H'];
$cities['331004'] = ['路桥区', 'L'];
$cities['331021'] = ['玉环县', 'Y'];
$cities['331022'] = ['三门县', 'S'];
$cities['331023'] = ['天台县', 'T'];
$cities['331024'] = ['仙居县', 'X'];
$cities['331081'] = ['温岭市', 'W'];
$cities['331082'] = ['临海市', 'L'];
// 丽水
$cities['331100'] = ['丽水', 'L'];
$cities['331102'] = ['莲都区', 'L'];
$cities['331121'] = ['青田县', 'Q'];
$cities['331122'] = ['缙云县', 'Y'];
$cities['331123'] = ['遂昌县', 'S'];
$cities['331124'] = ['松阳县', 'S'];
$cities['331125'] = ['云和县', 'Y'];
$cities['331126'] = ['庆元县', 'Q'];
$cities['331127'] = ['景宁畲族自治县', 'J'];
$cities['331181'] = ['龙泉市', 'L'];
// 浙江省结束
//======================================
// 安徽省
$cities['340000'] = ['安徽省', 'A'];
// 合肥
$cities['340100'] = ['合肥', 'H'];
$cities['340102'] = ['瑶海区', 'Y'];
$cities['340103'] = ['庐阳区', 'L'];
$cities['340104'] = ['蜀山区', 'S'];
$cities['340111'] = ['包河区', 'B'];
$cities['340121'] = ['长丰县', 'C'];
$cities['340122'] = ['肥东县', 'F'];
$cities['340123'] = ['肥西县', 'F'];
// 芜湖
$cities['340200'] = ['芜湖', 'W'];
$cities['340202'] = ['镜湖区', 'J'];
$cities['340203'] = ['戈江区', 'G'];
$cities['340204'] = ['新芜区', 'X'];
$cities['340207'] = ['鸠江区', 'J'];
$cities['340221'] = ['芜湖县', 'W'];
$cities['340222'] = ['繁昌县', 'F'];
$cities['340223'] = ['南陵县', 'N'];
// 蚌埠
$cities['340300'] = ['蚌埠', 'B'];
$cities['340302'] = ['龙子湖区', 'L'];
$cities['340303'] = ['蚌山区', 'B'];
$cities['340304'] = ['禹会区', 'Y'];
$cities['340311'] = ['淮上区', 'H'];
$cities['340321'] = ['怀远县', 'H'];
$cities['340322'] = ['五河县', 'W'];
$cities['340323'] = ['固镇县', 'G'];
// 淮南
$cities['340400'] = ['淮南', 'H'];
$cities['340402'] = ['大通区', 'D'];
$cities['340403'] = ['田家庵区', 'T'];
$cities['340404'] = ['谢家集区', 'X'];
$cities['340405'] = ['八公山区', 'B'];
$cities['340406'] = ['潘集区', 'P'];
$cities['340421'] = ['凤台县', 'F'];
// 马鞍山
$cities['340500'] = ['马鞍山', 'M'];
$cities['340502'] = ['金家庄区', 'J'];
$cities['340503'] = ['花山区', 'H'];
$cities['340504'] = ['雨山区', 'Y'];
$cities['340521'] = ['当涂县', 'D'];
$cities['340506'] = ['博望区', 'B'];
// 淮北
$cities['340600'] = ['淮北', 'H'];
$cities['340602'] = ['杜集区', 'D'];
$cities['340603'] = ['相山区', 'X'];
$cities['340604'] = ['烈山区', 'L'];
$cities['340621'] = ['濉溪县', 'X'];
// 铜陵
$cities['340700'] = ['铜陵', 'T'];
$cities['340702'] = ['铜官山区', 'T'];
$cities['340703'] = ['狮子山区', 'S'];
$cities['340711'] = ['郊区', 'J'];
$cities['340721'] = ['铜陵县', 'T'];
// 安庆
$cities['340800'] = ['安庆', 'A'];
$cities['340802'] = ['迎江区', 'Y'];
$cities['340803'] = ['大观区', 'D'];
$cities['340811'] = ['郊区', 'J'];
$cities['340822'] = ['怀宁县', 'H'];
$cities['340823'] = ['枞阳县', 'Y'];
$cities['340824'] = ['潜山县', 'Q'];
$cities['340825'] = ['太湖县', 'T'];
$cities['340826'] = ['宿松县', 'S'];
$cities['340827'] = ['望江县', 'W'];
$cities['340828'] = ['岳西县', 'Y'];
$cities['340881'] = ['桐城市', 'T'];
// 黄山
$cities['341000'] = ['黄山', 'H'];
$cities['341002'] = ['屯溪区', 'T'];
$cities['341003'] = ['黄山区', 'H'];
$cities['341004'] = ['徽州区', 'H'];
$cities['341021'] = ['歙县', 'X'];
$cities['341022'] = ['休宁县', 'X'];
$cities['341023'] = ['黟县', 'X'];
$cities['341024'] = ['祁门县', 'Q'];
// 滁州
$cities['341100'] = ['滁州', 'C'];
$cities['341102'] = ['琅琊区', 'L'];
$cities['341103'] = ['南谯区', 'N'];
$cities['341122'] = ['来安县', 'L'];
$cities['341124'] = ['全椒县', 'Q'];
$cities['341125'] = ['定远县', 'D'];
$cities['341126'] = ['凤阳县', 'F'];
$cities['341181'] = ['天长市', 'T'];
$cities['341182'] = ['明光市', 'M'];
// 阜阳
$cities['341200'] = ['阜阳', 'F'];
$cities['341202'] = ['颍州区', 'Z'];
$cities['341203'] = ['颍东区', 'D'];
$cities['341204'] = ['颍泉区', 'Q'];
$cities['341221'] = ['临泉县', 'L'];
$cities['341222'] = ['太和县', 'T'];
$cities['341225'] = ['阜南县', 'F'];
$cities['341226'] = ['颍上县', 'S'];
$cities['341282'] = ['界首市', 'J'];
// 宿州
$cities['341300'] = ['宿州', 'S'];
$cities['341302'] = ['墉桥区', 'Q'];
$cities['341321'] = ['砀山县', 'S'];
$cities['341322'] = ['萧县', 'X'];
$cities['341323'] = ['灵璧县', 'L'];
$cities['341324'] = ['泗县', 'X'];
// 巢湖
$cities['341400'] = ['巢湖', 'C'];
$cities['341402'] = ['居巢区', 'J'];
$cities['341421'] = ['庐江县', 'L'];
$cities['341422'] = ['无为县', 'W'];
$cities['341423'] = ['含山县', 'H'];
$cities['341424'] = ['和县', 'H'];
// 六安
$cities['341500'] = ['六安', 'L'];
$cities['341502'] = ['金安区', 'J'];
$cities['341503'] = ['裕安区', 'Y'];
$cities['341521'] = ['寿县', 'S'];
$cities['341522'] = ['霍邱县', 'H'];
$cities['341523'] = ['舒城县', 'S'];
$cities['341524'] = ['金寨县', 'J'];
$cities['341525'] = ['霍山县', 'H'];
// 亳州
$cities['341600'] = ['亳州', 'Z'];
$cities['341602'] = ['谯城区', 'C'];
$cities['341621'] = ['涡阳县', 'W'];
$cities['341622'] = ['蒙城县', 'M'];
$cities['341623'] = ['利辛县', 'L'];
// 池州
$cities['341700'] = ['池州', 'C'];
$cities['341702'] = ['贵池区', 'G'];
$cities['341721'] = ['东至县', 'D'];
$cities['341722'] = ['石台县', 'S'];
$cities['341723'] = ['青阳县', 'Q'];
// 宣城
$cities['341800'] = ['宣城', 'X'];
$cities['341802'] = ['宣州区', 'X'];
$cities['341821'] = ['郎溪县', 'L'];
$cities['341822'] = ['广德县', 'G'];
$cities['341823'] = ['泾县', 'X'];
$cities['341824'] = ['绩溪县', 'J'];
$cities['341825'] = ['旌德县', 'D'];
$cities['341881'] = ['宁国市', 'N'];
// 安徽省结束
//======================================
// 福建省
$cities['350000'] = ['福建省', 'F'];
// 福州
$cities['350100'] = ['福州', 'F'];
$cities['350102'] = ['鼓楼区', 'G'];
$cities['350103'] = ['台江区', 'T'];
$cities['350104'] = ['仓山区', 'C'];
$cities['350105'] = ['马尾区', 'M'];
$cities['350111'] = ['晋安区', 'J'];
$cities['350121'] = ['闽侯县', 'M'];
$cities['350122'] = ['连江县', 'L'];
$cities['350123'] = ['罗源县', 'L'];
$cities['350124'] = ['闽清县', 'M'];
$cities['350125'] = ['永泰县', 'Y'];
$cities['350128'] = ['平潭县', 'P'];
$cities['350181'] = ['福清市', 'F'];
$cities['350182'] = ['长乐市', 'C'];
// 厦门
$cities['350200'] = ['厦门', 'X'];
$cities['350203'] = ['思明区', 'S'];
$cities['350205'] = ['海沧区', 'H'];
$cities['350206'] = ['湖里区', 'H'];
$cities['350211'] = ['集美区', 'J'];
$cities['350212'] = ['同安区', 'T'];
$cities['350213'] = ['翔安区', 'X'];
// 莆田
$cities['350300'] = ['莆田', 'P'];
$cities['350302'] = ['城厢区', 'C'];
$cities['350303'] = ['涵江区', 'H'];
$cities['350304'] = ['荔城区', 'L'];
$cities['350305'] = ['秀屿区', 'X'];
$cities['350322'] = ['仙游县', 'X'];
// 三明
$cities['350400'] = ['三明', 'S'];
$cities['350402'] = ['梅列区', 'M'];
$cities['350403'] = ['三元区', 'S'];
$cities['350421'] = ['明溪县', 'M'];
$cities['350423'] = ['清流县', 'Q'];
$cities['350424'] = ['宁化县', 'N'];
$cities['350425'] = ['大田县', 'D'];
$cities['350426'] = ['尤溪县', 'Y'];
$cities['350427'] = ['沙县', 'S'];
$cities['350428'] = ['将乐县', 'J'];
$cities['350429'] = ['泰宁县', 'T'];
$cities['350430'] = ['建宁县', 'J'];
$cities['350481'] = ['永安市', 'Y'];
// 泉州
$cities['350500'] = ['泉州', 'Q'];
$cities['350502'] = ['鲤城区', 'L'];
$cities['350503'] = ['丰泽区', 'F'];
$cities['350504'] = ['洛江区', 'L'];
$cities['350505'] = ['泉港区', 'Q'];
$cities['350521'] = ['惠安县', 'H'];
$cities['350524'] = ['安溪县', 'A'];
$cities['350525'] = ['永春县', 'Y'];
$cities['350526'] = ['德化县', 'D'];
$cities['350527'] = ['金门县', 'J'];
$cities['350581'] = ['石狮市', 'S'];
$cities['350582'] = ['晋江市', 'J'];
$cities['350583'] = ['南安市', 'N'];
// 漳州
$cities['350600'] = ['漳州', 'Z'];
$cities['350602'] = ['芗城区', 'C'];
$cities['350603'] = ['龙文区', 'L'];
$cities['350622'] = ['云霄县', 'Y'];
$cities['350623'] = ['漳浦县', 'Z'];
$cities['350624'] = ['诏安县', 'A'];
$cities['350625'] = ['长泰县', 'C'];
$cities['350626'] = ['东山县', 'D'];
$cities['350627'] = ['南靖县', 'N'];
$cities['350628'] = ['平和县', 'P'];
$cities['350629'] = ['华安县', 'H'];
$cities['350681'] = ['龙海市', 'L'];
// 南平
$cities['350700'] = ['南平', 'N'];
$cities['350702'] = ['延平区', 'Y'];
$cities['350721'] = ['顺昌县', 'S'];
$cities['350722'] = ['浦城县', 'P'];
$cities['350723'] = ['光泽县', 'G'];
$cities['350724'] = ['松溪县', 'S'];
$cities['350725'] = ['政和县', 'Z'];
$cities['350781'] = ['邵武市', 'S'];
$cities['350782'] = ['武夷山市', 'W'];
$cities['350783'] = ['建瓯市', 'J'];
$cities['350784'] = ['建阳市', 'J'];
// 龙岩
$cities['350800'] = ['龙岩', 'L'];
$cities['350802'] = ['新罗区', 'X'];
$cities['350821'] = ['长汀县', 'C'];
$cities['350822'] = ['永定县', 'Y'];
$cities['350823'] = ['上杭县', 'S'];
$cities['350824'] = ['武平县', 'W'];
$cities['350825'] = ['连城县', 'L'];
$cities['350881'] = ['漳平市', 'Z'];
// 宁德
$cities['350900'] = ['宁德', 'N'];
$cities['350902'] = ['蕉城区', 'J'];
$cities['350921'] = ['霞浦县', 'X'];
$cities['350922'] = ['古田县', 'G'];
$cities['350923'] = ['屏南县', 'P'];
$cities['350924'] = ['寿宁县', 'S'];
$cities['350925'] = ['周宁县', 'Z'];
$cities['350926'] = ['柘荣县', 'R'];
$cities['350981'] = ['福安市', 'F'];
$cities['350982'] = ['福鼎市', 'F'];
// 福建省结束
//======================================
// 江西省
$cities['360000'] = ['江西省', 'J'];
// 南昌
$cities['360100'] = ['南昌', 'N'];
$cities['360102'] = ['东湖区', 'D'];
$cities['360103'] = ['西湖区', 'X'];
$cities['360104'] = ['青云谱区', 'Q'];
$cities['360105'] = ['湾里区', 'W'];
$cities['360111'] = ['青山湖区', 'Q'];
$cities['360121'] = ['南昌县', 'N'];
$cities['360122'] = ['新建县', 'X'];
$cities['360123'] = ['安义县', 'A'];
$cities['360124'] = ['进贤县', 'J'];
// 景德镇
$cities['360200'] = ['景德镇', 'J'];
$cities['360202'] = ['昌江区', 'C'];
$cities['360203'] = ['珠山区', 'Z'];
$cities['360222'] = ['浮梁县', 'F'];
$cities['360281'] = ['乐平市', 'L'];
// 萍乡
$cities['360300'] = ['萍乡', 'P'];
$cities['360302'] = ['安源区', 'A'];
$cities['360313'] = ['湘东区', 'X'];
$cities['360321'] = ['莲花县', 'L'];
$cities['360322'] = ['上栗县', 'S'];
$cities['360323'] = ['芦溪县', 'L'];
// 九江
$cities['360400'] = ['九江', 'J'];
$cities['360402'] = ['庐山区', 'L'];
$cities['360403'] = ['浔阳区', 'Y'];
$cities['360421'] = ['九江县', 'J'];
$cities['360423'] = ['武宁县', 'W'];
$cities['360424'] = ['修水县', 'X'];
$cities['360425'] = ['永修县', 'Y'];
$cities['360426'] = ['德安县', 'D'];
$cities['360427'] = ['星子县', 'X'];
$cities['360428'] = ['都昌县', 'D'];
$cities['360429'] = ['湖口县', 'H'];
$cities['360430'] = ['彭泽县', 'P'];
$cities['360481'] = ['瑞昌市', 'R'];
// 新余
$cities['360500'] = ['新余', 'X'];
$cities['360502'] = ['渝水区', 'Y'];
$cities['360521'] = ['分宜县', 'F'];
// 鹰潭
$cities['360600'] = ['鹰潭', 'Y'];
$cities['360602'] = ['月湖区', 'Y'];
$cities['360622'] = ['余江县', 'Y'];
$cities['360681'] = ['贵溪市', 'G'];
// 赣州
$cities['360700'] = ['赣州', 'G'];
$cities['360702'] = ['章贡区', 'Z'];
$cities['360721'] = ['赣县', 'G'];
$cities['360722'] = ['信丰县', 'X'];
$cities['360723'] = ['大余县', 'D'];
$cities['360724'] = ['上犹县', 'S'];
$cities['360725'] = ['崇义县', 'C'];
$cities['360726'] = ['安远县', 'A'];
$cities['360727'] = ['龙南县', 'L'];
$cities['360728'] = ['定南县', 'D'];
$cities['360729'] = ['全南县', 'Q'];
$cities['360730'] = ['宁都县', 'N'];
$cities['360731'] = ['于都县', 'Y'];
$cities['360732'] = ['兴国县', 'X'];
$cities['360733'] = ['会昌县', 'H'];
$cities['360734'] = ['寻乌县', 'X'];
$cities['360735'] = ['石城县', 'S'];
$cities['360781'] = ['瑞金市', 'R'];
$cities['360782'] = ['南康市', 'N'];
// 吉安
$cities['360800'] = ['吉安', 'J'];
$cities['360802'] = ['吉州区', 'J'];
$cities['360803'] = ['青原区', 'Q'];
$cities['360821'] = ['吉安县', 'J'];
$cities['360822'] = ['吉水县', 'J'];
$cities['360823'] = ['峡江县', 'X'];
$cities['360824'] = ['新干县', 'X'];
$cities['360825'] = ['永丰县', 'Y'];
$cities['360826'] = ['泰和县', 'T'];
$cities['360827'] = ['遂川县', 'S'];
$cities['360828'] = ['万安县', 'W'];
$cities['360829'] = ['安福县', 'A'];
$cities['360830'] = ['永新县', 'Y'];
$cities['360881'] = ['井冈山市', 'J'];
// 宜春
$cities['360900'] = ['宜春', 'Y'];
$cities['360902'] = ['袁州区', 'Y'];
$cities['360921'] = ['奉新县', 'F'];
$cities['360922'] = ['万载县', 'W'];
$cities['360923'] = ['上高县', 'S'];
$cities['360924'] = ['宜丰县', 'Y'];
$cities['360925'] = ['靖安县', 'J'];
$cities['360926'] = ['铜鼓县', 'T'];
$cities['360981'] = ['丰城市', 'F'];
$cities['360982'] = ['樟树市', 'Z'];
$cities['360983'] = ['高安市', 'G'];
// 抚州
$cities['361000'] = ['抚州', 'F'];
$cities['361002'] = ['临川区', 'L'];
$cities['361021'] = ['南城县', 'N'];
$cities['361022'] = ['黎川县', 'L'];
$cities['361023'] = ['南丰县', 'N'];
$cities['361024'] = ['崇仁县', 'C'];
$cities['361025'] = ['乐安县', 'L'];
$cities['361026'] = ['宜黄县', 'Y'];
$cities['361027'] = ['金溪县', 'J'];
$cities['361028'] = ['资溪县', 'Z'];
$cities['361029'] = ['东乡县', 'D'];
$cities['361030'] = ['广昌县', 'G'];
// 上饶
$cities['361100'] = ['上饶', 'S'];
$cities['361102'] = ['信州区', 'X'];
$cities['361121'] = ['上饶县', 'S'];
$cities['361122'] = ['广丰县', 'G'];
$cities['361123'] = ['玉山县', 'Y'];
$cities['361124'] = ['铅山县', 'Q'];
$cities['361125'] = ['横峰县', 'H'];
$cities['361126'] = ['弋阳县', 'Y'];
$cities['361127'] = ['余干县', 'Y'];
$cities['361128'] = ['鄱阳县', 'Y'];
$cities['361129'] = ['万年县', 'W'];
$cities['361130'] = ['婺源县', 'Y'];
$cities['361181'] = ['德兴市', 'D'];
// 江西省结束
//======================================
// 山东省
$cities['370000'] = ['山东省', 'S'];
// 济南
$cities['370100'] = ['济南', 'J'];
$cities['370102'] = ['历下区', 'L'];
$cities['370103'] = ['市中区', 'S'];
$cities['370104'] = ['槐荫区', 'H'];
$cities['370105'] = ['天桥区', 'T'];
$cities['370112'] = ['历城区', 'L'];
$cities['370113'] = ['长清区', 'C'];
$cities['370124'] = ['平阴县', 'P'];
$cities['370125'] = ['济阳县', 'J'];
$cities['370126'] = ['商河县', 'S'];
$cities['370181'] = ['章丘市', 'Z'];
// 青岛
$cities['370200'] = ['青岛', 'Q'];
$cities['370202'] = ['市南区', 'S'];
$cities['370203'] = ['市北区', 'S'];
$cities['370205'] = ['四方区', 'S'];
$cities['370211'] = ['黄岛区', 'H'];
$cities['370212'] = ['崂山区', 'S'];
$cities['370213'] = ['李沧区', 'L'];
$cities['370214'] = ['城阳区', 'C'];
$cities['370281'] = ['胶州市', 'J'];
$cities['370282'] = ['即墨市', 'J'];
$cities['370283'] = ['平度市', 'P'];
$cities['370284'] = ['胶南市', 'J'];
$cities['370285'] = ['莱西市', 'L'];
// 淄博
$cities['370300'] = ['淄博', 'Z'];
$cities['370302'] = ['淄川区', 'Z'];
$cities['370303'] = ['张店区', 'Z'];
$cities['370304'] = ['博山区', 'B'];
$cities['370305'] = ['临淄区', 'L'];
$cities['370306'] = ['周村区', 'Z'];
$cities['370321'] = ['桓台县', 'H'];
$cities['370322'] = ['高青县', 'G'];
$cities['370323'] = ['沂源县', 'Y'];
// 枣庄
$cities['370400'] = ['枣庄', 'Z'];
$cities['370402'] = ['市中区', 'S'];
$cities['370403'] = ['薛城区', 'X'];
$cities['370404'] = ['峄城区', 'C'];
$cities['370405'] = ['台儿庄区', 'T'];
$cities['370406'] = ['山亭区', 'S'];
$cities['370481'] = ['滕州市', 'Z'];
// 东营
$cities['370500'] = ['东营', 'D'];
$cities['370502'] = ['东营区', 'D'];
$cities['370503'] = ['河口区', 'H'];
$cities['370521'] = ['垦利县', 'K'];
$cities['370522'] = ['利津县', 'L'];
$cities['370523'] = ['广饶县', 'G'];
// 烟台
$cities['370600'] = ['烟台', 'Y'];
$cities['370602'] = ['芝罘区', 'Z'];
$cities['370611'] = ['福山区', 'F'];
$cities['370612'] = ['牟平区', 'M'];
$cities['370613'] = ['莱山区', 'L'];
$cities['370634'] = ['长岛县', 'C'];
$cities['370681'] = ['龙口市', 'L'];
$cities['370682'] = ['莱阳市', 'L'];
$cities['370683'] = ['莱州市', 'L'];
$cities['370684'] = ['蓬莱市', 'P'];
$cities['370685'] = ['招远市', 'Z'];
$cities['370686'] = ['栖霞市', 'Q'];
$cities['370687'] = ['海阳市', 'H'];
// 潍坊
$cities['370700'] = ['潍坊', 'W'];
$cities['370702'] = ['潍城区', 'W'];
$cities['370703'] = ['寒亭区', 'H'];
$cities['370704'] = ['坊子区', 'F'];
$cities['370705'] = ['奎文区', 'K'];
$cities['370724'] = ['临朐县', 'L'];
$cities['370725'] = ['昌乐县', 'C'];
$cities['370781'] = ['青州市', 'Q'];
$cities['370782'] = ['诸城市', 'Z'];
$cities['370783'] = ['寿光市', 'S'];
$cities['370784'] = ['安丘市', 'A'];
$cities['370785'] = ['高密市', 'G'];
$cities['370786'] = ['昌邑市', 'C'];
// 济宁
$cities['370800'] = ['济宁', 'J'];
$cities['370802'] = ['市中区', 'S'];
$cities['370811'] = ['任城区', 'R'];
$cities['370826'] = ['微山县', 'W'];
$cities['370827'] = ['鱼台县', 'Y'];
$cities['370828'] = ['金乡县', 'J'];
$cities['370829'] = ['嘉祥县', 'J'];
$cities['370830'] = ['汶上县', 'S'];
$cities['370831'] = ['泗水县', 'S'];
$cities['370832'] = ['梁山县', 'L'];
$cities['370881'] = ['曲阜市', 'Q'];
$cities['370882'] = ['兖州市', 'Z'];
$cities['370883'] = ['邹城市', 'Z'];
// 泰安
$cities['370900'] = ['泰安', 'T'];
$cities['370902'] = ['泰山区', 'T'];
$cities['370903'] = ['岱岳区', 'Y'];
$cities['370921'] = ['宁阳县', 'N'];
$cities['370923'] = ['东平县', 'D'];
$cities['370982'] = ['新泰市', 'X'];
$cities['370983'] = ['肥城市', 'F'];
// 威海
$cities['371000'] = ['威海', 'W'];
$cities['371002'] = ['环翠区', 'H'];
$cities['371081'] = ['文登市', 'W'];
$cities['371082'] = ['荣成市', 'R'];
$cities['371083'] = ['乳山市', 'R'];
// 日照
$cities['371100'] = ['日照', 'R'];
$cities['371102'] = ['东港区', 'D'];
$cities['371103'] = ['岚山区', 'S'];
$cities['371121'] = ['五莲县', 'W'];
$cities['371122'] = ['莒县', 'X'];
// 莱芜
$cities['371200'] = ['莱芜', 'L'];
$cities['371202'] = ['莱城区', 'L'];
$cities['371203'] = ['钢城区', 'G'];
// 临沂
$cities['371300'] = ['临沂', 'L'];
$cities['371302'] = ['兰山区', 'L'];
$cities['371311'] = ['罗庄区', 'L'];
$cities['371312'] = ['河东区', 'H'];
$cities['371321'] = ['沂南县', 'Y'];
$cities['371322'] = ['郯城县', 'C'];
$cities['371323'] = ['沂水县', 'Y'];
$cities['371324'] = ['苍山县', 'C'];
$cities['371325'] = ['费县', 'F'];
$cities['371326'] = ['平邑县', 'P'];
$cities['371327'] = ['莒南县', 'N'];
$cities['371328'] = ['蒙阴县', 'M'];
$cities['371329'] = ['临沭县', 'L'];
// 德州
$cities['371400'] = ['德州', 'D'];
$cities['371402'] = ['德城区', 'D'];
$cities['371421'] = ['陵县', 'L'];
$cities['371422'] = ['宁津县', 'N'];
$cities['371423'] = ['庆云县', 'Q'];
$cities['371424'] = ['临邑县', 'L'];
$cities['371425'] = ['齐河县', 'Q'];
$cities['371426'] = ['平原县', 'P'];
$cities['371427'] = ['夏津县', 'X'];
$cities['371428'] = ['武城县', 'W'];
$cities['371481'] = ['乐陵市', 'L'];
$cities['371482'] = ['禹城市', 'Y'];
// 聊城
$cities['371500'] = ['聊城', 'L'];
$cities['371502'] = ['东昌府区', 'D'];
$cities['371521'] = ['阳谷县', 'Y'];
$cities['371522'] = ['莘县', 'X'];
$cities['371523'] = ['茌平县', 'P'];
$cities['371524'] = ['东阿县', 'D'];
$cities['371525'] = ['冠县', 'G'];
$cities['371526'] = ['高唐县', 'G'];
$cities['371581'] = ['临清市', 'L'];
// 滨州
$cities['371600'] = ['滨州', 'B'];
$cities['371602'] = ['滨城区', 'B'];
$cities['371621'] = ['惠民县', 'H'];
$cities['371622'] = ['阳信县', 'Y'];
$cities['371623'] = ['无棣县', 'W'];
$cities['371624'] = ['沾化县', 'Z'];
$cities['371625'] = ['博兴县', 'B'];
$cities['371626'] = ['邹平县', 'Z'];
// 菏泽
$cities['371700'] = ['菏泽', 'H'];
$cities['371702'] = ['牡丹区', 'M'];
$cities['371721'] = ['曹县', 'C'];
$cities['371722'] = ['单县', 'D'];
$cities['371723'] = ['成武县', 'C'];
$cities['371724'] = ['巨野县', 'J'];
$cities['371725'] = ['郓城县', 'C'];
$cities['371726'] = ['鄄城县', 'C'];
$cities['371727'] = ['定陶县', 'D'];
$cities['371728'] = ['东明县', 'D'];
// 山东省结束
//======================================
// 河南省
$cities['410000'] = ['河南省', 'H'];
// 郑州
$cities['410100'] = ['郑州', 'Z'];
$cities['410102'] = ['中原区', 'Z'];
$cities['410103'] = ['二七区', 'E'];
$cities['410104'] = ['管城回族区', 'G'];
$cities['410105'] = ['金水区', 'J'];
$cities['410106'] = ['上街区', 'S'];
$cities['410108'] = ['惠济区', 'H'];
$cities['410122'] = ['中牟县', 'Z'];
$cities['410181'] = ['巩义市', 'G'];
$cities['410182'] = ['荥阳市', 'Y'];
$cities['410183'] = ['新密市', 'X'];
$cities['410184'] = ['新郑市', 'X'];
$cities['410185'] = ['登封市', 'D'];
// 开封
$cities['410200'] = ['开封', 'K'];
$cities['410202'] = ['龙亭区', 'L'];
$cities['410203'] = ['顺河回族区', 'S'];
$cities['410204'] = ['鼓楼区', 'G'];
$cities['410205'] = ['南关区', 'N'];
$cities['410211'] = ['郊区', 'J'];
$cities['410221'] = ['杞县', 'X'];
$cities['410222'] = ['通许县', 'T'];
$cities['410223'] = ['尉氏县', 'W'];
$cities['410224'] = ['开封县', 'K'];
$cities['410225'] = ['兰考县', 'L'];
// 洛阳
$cities['410300'] = ['洛阳', 'L'];
$cities['410302'] = ['老城区', 'L'];
$cities['410303'] = ['西工区', 'X'];
$cities['410304'] = ['廛河回族区', 'H'];
$cities['410305'] = ['涧西区', 'J'];
$cities['410306'] = ['吉利区', 'J'];
$cities['410307'] = ['洛龙区', 'L'];
$cities['410322'] = ['孟津县', 'M'];
$cities['410323'] = ['新安县', 'X'];
$cities['410324'] = ['栾川县', 'C'];
$cities['410325'] = ['嵩县', 'X'];
$cities['410326'] = ['汝阳县', 'R'];
$cities['410327'] = ['宜阳县', 'Y'];
$cities['410328'] = ['洛宁县', 'L'];
$cities['410329'] = ['伊川县', 'Y'];
$cities['410381'] = ['偃师市', 'S'];
// 平顶山
$cities['410400'] = ['平顶山', 'P'];
$cities['410402'] = ['新华区', 'X'];
$cities['410403'] = ['卫东区', 'W'];
$cities['410404'] = ['石龙区', 'S'];
$cities['410411'] = ['湛河区', 'Z'];
$cities['410421'] = ['宝丰县', 'B'];
$cities['410422'] = ['叶县', 'Y'];
$cities['410423'] = ['鲁山县', 'L'];
$cities['410425'] = ['郏县', 'X'];
$cities['410481'] = ['舞钢市', 'W'];
$cities['410482'] = ['汝州市', 'R'];
// 安阳
$cities['410500'] = ['安阳', 'A'];
$cities['410502'] = ['文峰区', 'W'];
$cities['410503'] = ['北关区', 'B'];
$cities['410505'] = ['殷都区', 'Y'];
$cities['410506'] = ['龙安区', 'L'];
$cities['410522'] = ['安阳县', 'A'];
$cities['410523'] = ['汤阴县', 'T'];
$cities['410526'] = ['滑县', 'H'];
$cities['410527'] = ['内黄县', 'N'];
$cities['410581'] = ['林州市', 'L'];
// 鹤壁
$cities['410600'] = ['鹤壁', 'H'];
$cities['410602'] = ['鹤山区', 'H'];
$cities['410603'] = ['山城区', 'S'];
$cities['410611'] = ['淇滨区', 'B'];
$cities['410621'] = ['浚县', 'J'];
$cities['410622'] = ['淇县', 'X'];
// 新乡
$cities['410700'] = ['新乡', 'X'];
$cities['410702'] = ['红旗区', 'H'];
$cities['410703'] = ['卫滨区', 'W'];
$cities['410704'] = ['凤泉区', 'F'];
$cities['410711'] = ['牧野区', 'M'];
$cities['410721'] = ['新乡县', 'X'];
$cities['410724'] = ['获嘉县', 'H'];
$cities['410725'] = ['原阳县', 'Y'];
$cities['410726'] = ['延津县', 'Y'];
$cities['410727'] = ['封丘县', 'F'];
$cities['410728'] = ['长垣县', 'C'];
$cities['410781'] = ['卫辉市', 'W'];
$cities['410782'] = ['辉县市', 'H'];
// 济源
$cities['410881'] = ['济源', 'J'];
$cities['410802'] = ['解放区', 'J'];
$cities['410803'] = ['中站区', 'Z'];
$cities['410804'] = ['马村区', 'M'];
$cities['410811'] = ['山阳区', 'S'];
$cities['410821'] = ['修武县', 'X'];
$cities['410822'] = ['博爱县', 'B'];
$cities['410823'] = ['武陟县', 'W'];
$cities['410825'] = ['温县', 'W'];
$cities['410881'] = ['济源市', 'J'];
$cities['410882'] = ['沁阳市', 'Q'];
$cities['410883'] = ['孟州市', 'M'];
// 濮阳
$cities['410900'] = ['濮阳', 'Y'];
$cities['410902'] = ['华龙区', 'H'];
$cities['410922'] = ['清丰县', 'Q'];
$cities['410923'] = ['南乐县', 'N'];
$cities['410926'] = ['范县', 'F'];
$cities['410927'] = ['台前县', 'T'];
$cities['410928'] = ['濮阳县', 'Y'];
// 许昌
$cities['411000'] = ['许昌', 'X'];
$cities['411002'] = ['魏都区', 'W'];
$cities['411023'] = ['许昌县', 'X'];
$cities['411024'] = ['鄢陵县', 'L'];
$cities['411025'] = ['襄城县', 'X'];
$cities['411081'] = ['禹州市', 'Y'];
$cities['411082'] = ['长葛市', 'C'];
// 漯河
$cities['411100'] = ['漯河', 'H'];
$cities['411102'] = ['源汇区', 'Y'];
$cities['411103'] = ['郾城区', 'C'];
$cities['411104'] = ['召陵区', 'Z'];
$cities['411121'] = ['舞阳县', 'W'];
$cities['411122'] = ['临颍县', 'L'];
// 三门峡
$cities['411200'] = ['三门峡', 'S'];
$cities['411202'] = ['湖滨区', 'H'];
$cities['411221'] = ['渑池县', 'C'];
$cities['411222'] = ['陕县', 'S'];
$cities['411224'] = ['卢氏县', 'L'];
$cities['411281'] = ['义马市', 'Y'];
$cities['411282'] = ['灵宝市', 'L'];
// 南阳
$cities['411300'] = ['南阳', 'N'];
$cities['411302'] = ['宛城区', 'W'];
$cities['411303'] = ['卧龙区', 'W'];
$cities['411321'] = ['南召县', 'N'];
$cities['411322'] = ['方城县', 'F'];
$cities['411323'] = ['西峡县', 'X'];
$cities['411324'] = ['镇平县', 'Z'];
$cities['411325'] = ['内乡县', 'N'];
$cities['411326'] = ['淅川县', 'C'];
$cities['411327'] = ['社旗县', 'S'];
$cities['411328'] = ['唐河县', 'T'];
$cities['411329'] = ['新野县', 'X'];
$cities['411330'] = ['桐柏县', 'T'];
$cities['411381'] = ['邓州市', 'D'];
// 商丘
$cities['411400'] = ['商丘', 'S'];
$cities['411402'] = ['梁园区', 'L'];
$cities['411403'] = ['睢阳区', 'Y'];
$cities['411421'] = ['民权县', 'M'];
$cities['411422'] = ['睢县', 'X'];
$cities['411423'] = ['宁陵县', 'N'];
$cities['411424'] = ['柘城县', 'C'];
$cities['411425'] = ['虞城县', 'Y'];
$cities['411426'] = ['夏邑县', 'X'];
$cities['411481'] = ['永城市', 'Y'];
// 信阳
$cities['411500'] = ['信阳', 'X'];
$cities['411502'] = ['师河区', 'S'];
$cities['411503'] = ['平桥区', 'P'];
$cities['411521'] = ['罗山县', 'L'];
$cities['411522'] = ['光山县', 'G'];
$cities['411523'] = ['新县', 'X'];
$cities['411524'] = ['商城县', 'S'];
$cities['411525'] = ['固始县', 'G'];
$cities['411526'] = ['潢川县', 'C'];
$cities['411527'] = ['淮滨县', 'H'];
$cities['411528'] = ['息县', 'X'];
// 周口
$cities['411600'] = ['周口', 'Z'];
$cities['411602'] = ['川汇区', 'C'];
$cities['411621'] = ['扶沟县', 'F'];
$cities['411622'] = ['西华县', 'X'];
$cities['411623'] = ['商水县', 'S'];
$cities['411624'] = ['沈丘县', 'S'];
$cities['411625'] = ['郸城县', 'D'];
$cities['411626'] = ['淮阳县', 'H'];
$cities['411627'] = ['太康县', 'T'];
$cities['411628'] = ['鹿邑县', 'L'];
$cities['411681'] = ['项城市', 'X'];
// 驻马店
$cities['411700'] = ['驻马店', 'Z'];
$cities['411702'] = ['驿城区', 'C'];
$cities['411721'] = ['西平县', 'X'];
$cities['411722'] = ['上蔡县', 'S'];
$cities['411723'] = ['平舆县', 'P'];
$cities['411724'] = ['正阳县', 'Z'];
$cities['411725'] = ['确山县', 'Q'];
$cities['411726'] = ['泌阳县', 'M'];
$cities['411727'] = ['汝南县', 'R'];
$cities['411728'] = ['遂平县', 'S'];
$cities['411729'] = ['新蔡县', 'X'];
// 河南省结束
//======================================
// 湖北省
$cities['420000'] = ['湖北省', 'H'];
// 武汉
$cities['420100'] = ['武汉', 'W'];
$cities['420102'] = ['江岸区', 'J'];
$cities['420103'] = ['江汉区', 'J'];
$cities['420104'] = ['乔口区', 'Q'];
$cities['420105'] = ['汉阳区', 'H'];
$cities['420106'] = ['武昌区', 'W'];
$cities['420107'] = ['青山区', 'Q'];
$cities['420111'] = ['洪山区', 'H'];
$cities['420112'] = ['东西湖区', 'D'];
$cities['420113'] = ['汉南区', 'H'];
$cities['420114'] = ['蔡甸区', 'C'];
$cities['420115'] = ['江夏区', 'J'];
$cities['420116'] = ['黄陂区', 'H'];
$cities['420117'] = ['新洲区', 'X'];
// 黄石
$cities['420200'] = ['黄石', 'H'];
$cities['420202'] = ['黄石港区', 'H'];
$cities['420203'] = ['西塞山区', 'X'];
$cities['420204'] = ['下陆区', 'X'];
$cities['420205'] = ['铁山区', 'T'];
$cities['420222'] = ['阳新县', 'Y'];
$cities['420281'] = ['大冶市', 'D'];
// 十堰
$cities['420300'] = ['十堰', 'S'];
$cities['420302'] = ['茅箭区', 'M'];
$cities['420303'] = ['张湾区', 'Z'];
$cities['420321'] = ['郧县', 'Y'];
$cities['420322'] = ['郧西县', 'Y'];
$cities['420323'] = ['竹山县', 'Z'];
$cities['420324'] = ['竹溪县', 'Z'];
$cities['420325'] = ['房县', 'F'];
$cities['420381'] = ['丹江口市', 'D'];
// 宜昌
$cities['420500'] = ['宜昌', 'Y'];
$cities['420502'] = ['西陵区', 'X'];
$cities['420503'] = ['伍家岗区', 'W'];
$cities['420504'] = ['点军区', 'D'];
$cities['420505'] = ['猇亭区', 'T'];
$cities['420506'] = ['夷陵区', 'Y'];
$cities['420525'] = ['远安县', 'Y'];
$cities['420526'] = ['兴山县', 'X'];
$cities['420527'] = ['秭归县', 'G'];
$cities['420528'] = ['长阳土家族自治县', 'C'];
$cities['420529'] = ['五峰土家族自治县', 'W'];
$cities['420581'] = ['宜都市', 'Y'];
$cities['420582'] = ['当阳市', 'D'];
$cities['420583'] = ['枝江市', 'Z'];
// 襄阳
$cities['420600'] = ['襄阳', 'X'];
$cities['420602'] = ['襄城区', 'X'];
$cities['420606'] = ['樊城区', 'F'];
$cities['420607'] = ['襄阳区', 'X'];
$cities['420624'] = ['南漳县', 'N'];
$cities['420625'] = ['谷城县', 'G'];
$cities['420626'] = ['保康县', 'B'];
$cities['420682'] = ['老河口市', 'L'];
$cities['420683'] = ['枣阳市', 'Z'];
$cities['420684'] = ['宜城市', 'Y'];
// 鄂州
$cities['420700'] = ['鄂州', 'E'];
$cities['420702'] = ['梁子湖区', 'L'];
$cities['420703'] = ['华容区', 'H'];
$cities['420704'] = ['鄂城区', 'E'];
// 荆门
$cities['420800'] = ['荆门', 'J'];
$cities['420802'] = ['东宝区', 'D'];
$cities['420804'] = ['掇刀区', 'D'];
$cities['420821'] = ['京山县', 'J'];
$cities['420822'] = ['沙洋县', 'S'];
$cities['420881'] = ['钟祥市', 'Z'];
// 孝感
$cities['420900'] = ['孝感', 'X'];
$cities['420902'] = ['孝南区', 'X'];
$cities['420921'] = ['孝昌县', 'X'];
$cities['420922'] = ['大悟县', 'D'];
$cities['420923'] = ['云梦县', 'Y'];
$cities['420981'] = ['应城市', 'Y'];
$cities['420982'] = ['安陆市', 'A'];
$cities['420984'] = ['汉川市', 'H'];
// 荆州
$cities['421000'] = ['荆州', 'J'];
$cities['421002'] = ['沙市区', 'S'];
$cities['421003'] = ['荆州区', 'J'];
$cities['421022'] = ['公安县', 'G'];
$cities['421023'] = ['监利县', 'J'];
$cities['421024'] = ['江陵县', 'J'];
$cities['421081'] = ['石首市', 'S'];
$cities['421083'] = ['洪湖市', 'H'];
$cities['421087'] = ['松滋市', 'S'];
// 黄冈
$cities['421100'] = ['黄冈', 'H'];
$cities['421102'] = ['黄州区', 'H'];
$cities['421121'] = ['团风县', 'T'];
$cities['421122'] = ['红安县', 'H'];
$cities['421123'] = ['罗田县', 'L'];
$cities['421124'] = ['英山县', 'Y'];
$cities['421125'] = ['浠水县', 'S'];
$cities['421126'] = ['蕲春县', 'C'];
$cities['421127'] = ['黄梅县', 'H'];
$cities['421181'] = ['麻城市', 'M'];
$cities['421182'] = ['武穴市', 'W'];
// 咸宁
$cities['421200'] = ['咸宁', 'X'];
$cities['421202'] = ['咸安区', 'X'];
$cities['421221'] = ['嘉鱼县', 'J'];
$cities['421222'] = ['通城县', 'T'];
$cities['421223'] = ['崇阳县', 'C'];
$cities['421224'] = ['通山县', 'T'];
$cities['421281'] = ['赤壁市', 'C'];
// 随州
$cities['421300'] = ['随州', 'S'];
$cities['421302'] = ['曾都区', 'Z'];
$cities['421381'] = ['广水市', 'G'];
// 恩施
$cities['422800'] = ['恩施', 'E'];
$cities['422801'] = ['恩施市', 'E'];
$cities['422802'] = ['利川市', 'L'];
$cities['422822'] = ['建始县', 'J'];
$cities['422823'] = ['巴东县', 'B'];
$cities['422825'] = ['宣恩县', 'X'];
$cities['422826'] = ['咸丰县', 'X'];
$cities['422827'] = ['来凤县', 'L'];
$cities['422828'] = ['鹤峰县', 'H'];
// 神农架
$cities['429021'] = ['神农架', 'S'];
// 湖北省结束
//======================================
// 湖南省
$cities['430000'] = ['湖南省', 'H'];
// 长沙
$cities['430100'] = ['长沙', 'C'];
$cities['430102'] = ['芙蓉区', 'R'];
$cities['430103'] = ['天心区', 'T'];
$cities['430104'] = ['岳麓区', 'Y'];
$cities['430105'] = ['开福区', 'K'];
$cities['430111'] = ['雨花区', 'Y'];
$cities['430121'] = ['长沙县', 'C'];
$cities['430122'] = ['望城县', 'W'];
$cities['430124'] = ['宁乡县', 'N'];
$cities['430181'] = ['浏阳市', 'Y'];
// 株洲
$cities['430200'] = ['株洲', 'Z'];
$cities['430202'] = ['荷塘区', 'H'];
$cities['430203'] = ['芦淞区', 'L'];
$cities['430204'] = ['石峰区', 'S'];
$cities['430211'] = ['天元区', 'T'];
$cities['430221'] = ['株洲县', 'Z'];
$cities['430223'] = ['攸县', 'X'];
$cities['430224'] = ['茶陵县', 'C'];
$cities['430225'] = ['炎陵县', 'Y'];
$cities['430281'] = ['醴陵市', 'L'];
// 湘潭
$cities['430300'] = ['湘潭', 'X'];
$cities['430302'] = ['雨湖区', 'Y'];
$cities['430304'] = ['岳塘区', 'Y'];
$cities['430321'] = ['湘潭县', 'X'];
$cities['430381'] = ['湘乡市', 'X'];
$cities['430382'] = ['韶山市', 'S'];
// 衡阳
$cities['430400'] = ['衡阳', 'H'];
$cities['430405'] = ['珠晖区', 'Z'];
$cities['430406'] = ['雁峰区', 'Y'];
$cities['430407'] = ['石鼓区', 'S'];
$cities['430408'] = ['蒸湘区', 'Z'];
$cities['430412'] = ['南岳区', 'N'];
$cities['430421'] = ['衡阳县', 'H'];
$cities['430422'] = ['衡南县', 'H'];
$cities['430423'] = ['衡山县', 'H'];
$cities['430424'] = ['衡东县', 'H'];
$cities['430426'] = ['祁东县', 'Q'];
$cities['430481'] = ['耒阳市', 'Y'];
$cities['430482'] = ['常宁市', 'C'];
// 邵阳
$cities['430500'] = ['邵阳', 'S'];
$cities['430502'] = ['双清区', 'S'];
$cities['430503'] = ['大祥区', 'D'];
$cities['430511'] = ['北塔区', 'B'];
$cities['430521'] = ['邵东县', 'S'];
$cities['430522'] = ['新邵县', 'X'];
$cities['430523'] = ['邵阳县', 'S'];
$cities['430524'] = ['隆回县', 'L'];
$cities['430525'] = ['洞口县', 'D'];
$cities['430527'] = ['绥宁县', 'S'];
$cities['430528'] = ['新宁县', 'X'];
$cities['430529'] = ['城步苗族自治县', 'C'];
$cities['430581'] = ['武冈市', 'W'];
// 岳阳
$cities['430600'] = ['岳阳', 'Y'];
$cities['430602'] = ['岳阳楼区', 'Y'];
$cities['430603'] = ['云溪区', 'Y'];
$cities['430611'] = ['君山区', 'J'];
$cities['430621'] = ['岳阳县', 'Y'];
$cities['430623'] = ['华容县', 'H'];
$cities['430624'] = ['湘阴县', 'X'];
$cities['430626'] = ['平江县', 'P'];
$cities['430681'] = ['汨罗市', 'L'];
$cities['430682'] = ['临湘市', 'L'];
// 常德
$cities['430700'] = ['常德', 'C'];
$cities['430702'] = ['武陵区', 'W'];
$cities['430703'] = ['鼎城区', 'D'];
$cities['430721'] = ['安乡县', 'A'];
$cities['430722'] = ['汉寿县', 'H'];
$cities['430723'] = ['澧县', 'X'];
$cities['430724'] = ['临澧县', 'L'];
$cities['430725'] = ['桃源县', 'T'];
$cities['430726'] = ['石门县', 'S'];
$cities['430781'] = ['津市市', 'J'];
// 张家界
$cities['430800'] = ['张家界', 'Z'];
$cities['430802'] = ['永定区', 'Y'];
$cities['430811'] = ['武陵源区', 'W'];
$cities['430821'] = ['慈利县', 'C'];
$cities['430822'] = ['桑植县', 'S'];
// 益阳
$cities['430900'] = ['益阳', 'Y'];
$cities['430902'] = ['资阳区', 'Z'];
$cities['430903'] = ['赫山区', 'H'];
$cities['430921'] = ['南县', 'N'];
$cities['430922'] = ['桃江县', 'T'];
$cities['430923'] = ['安化县', 'A'];
$cities['430981'] = ['沅江市', 'J'];
// 郴州
$cities['431000'] = ['郴州', 'C'];
$cities['431002'] = ['北湖区', 'B'];
$cities['431003'] = ['苏仙区', 'S'];
$cities['431021'] = ['桂阳县', 'G'];
$cities['431022'] = ['宜章县', 'Y'];
$cities['431023'] = ['永兴县', 'Y'];
$cities['431024'] = ['嘉禾县', 'J'];
$cities['431025'] = ['临武县', 'L'];
$cities['431026'] = ['汝城县', 'R'];
$cities['431027'] = ['桂东县', 'G'];
$cities['431028'] = ['安仁县', 'A'];
$cities['431081'] = ['资兴市', 'Z'];
// 永州
$cities['431100'] = ['永州', 'Y'];
$cities['431102'] = ['芝山区', 'Z'];
$cities['431103'] = ['冷水滩区', 'L'];
$cities['431121'] = ['祁阳县', 'Q'];
$cities['431122'] = ['东安县', 'D'];
$cities['431123'] = ['双牌县', 'S'];
$cities['431124'] = ['道县', 'D'];
$cities['431125'] = ['江永县', 'J'];
$cities['431126'] = ['宁远县', 'N'];
$cities['431127'] = ['蓝山县', 'L'];
$cities['431128'] = ['新田县', 'X'];
$cities['431129'] = ['江华瑶族自治县', 'J'];
// 怀化
$cities['431200'] = ['怀化', 'H'];
$cities['431202'] = ['鹤城区', 'H'];
$cities['431221'] = ['中方县', 'Z'];
$cities['431222'] = ['沅陵县', 'L'];
$cities['431223'] = ['辰溪县', 'C'];
$cities['431224'] = ['溆浦县', 'P'];
$cities['431225'] = ['会同县', 'H'];
$cities['431226'] = ['麻阳苗族自治县', 'M'];
$cities['431227'] = ['新晃侗族自治县', 'X'];
$cities['431228'] = ['芷江侗族自治县', 'J'];
$cities['431229'] = ['靖州苗族侗族自治县', 'J'];
$cities['431230'] = ['通道侗族自治县', 'T'];
$cities['431281'] = ['洪江市', 'H'];
// 娄底
$cities['431300'] = ['娄底', 'L'];
$cities['431302'] = ['娄星区', 'L'];
$cities['431321'] = ['双峰县', 'S'];
$cities['431322'] = ['新化县', 'X'];
$cities['431381'] = ['冷水江市', 'L'];
$cities['431382'] = ['涟源市', 'L'];
// 湘西
$cities['433100'] = ['湘西', 'X'];
$cities['433101'] = ['吉首市', 'J'];
$cities['433122'] = ['泸溪县', 'X'];
$cities['433123'] = ['凤凰县', 'F'];
$cities['433124'] = ['花垣县', 'H'];
$cities['433125'] = ['保靖县', 'B'];
$cities['433126'] = ['古丈县', 'G'];
$cities['433127'] = ['永顺县', 'Y'];
$cities['433130'] = ['龙山县', 'L'];
// 湖南省结束
//======================================
// 广东省
$cities['440000'] = ['广东省', 'G'];
// 广州
$cities['440100'] = ['广州', 'G'];
$cities['440102'] = ['东山区', 'D'];
$cities['440103'] = ['荔湾区', 'L'];
$cities['440104'] = ['越秀区', 'Y'];
$cities['440105'] = ['海珠区', 'H'];
$cities['440106'] = ['天河区', 'T'];
$cities['440107'] = ['芳村区', 'F'];
$cities['440111'] = ['白云区', 'B'];
$cities['440112'] = ['黄埔区', 'H'];
$cities['440113'] = ['番禺区', 'F'];
$cities['440114'] = ['花都区', 'H'];
$cities['440183'] = ['增城市', 'Z'];
$cities['440184'] = ['从化市', 'C'];
$cities['440115'] = ['南沙区', 'N'];
// 韶关
$cities['440200'] = ['韶关', 'S'];
$cities['440203'] = ['武江区', 'W'];
$cities['440204'] = ['浈江区', 'J'];
$cities['440205'] = ['曲江区', 'Q'];
$cities['440222'] = ['始兴县', 'S'];
$cities['440224'] = ['仁化县', 'R'];
$cities['440229'] = ['翁源县', 'W'];
$cities['440232'] = ['乳源瑶族自治县', 'R'];
$cities['440233'] = ['新丰县', 'X'];
$cities['440281'] = ['乐昌市', 'L'];
$cities['440282'] = ['南雄市', 'N'];
// 深圳
$cities['440300'] = ['深圳', 'S'];
$cities['440303'] = ['罗湖区', 'L'];
$cities['440304'] = ['福田区', 'F'];
$cities['440305'] = ['南山区', 'N'];
$cities['440306'] = ['宝安区', 'B'];
$cities['440307'] = ['龙岗区', 'L'];
$cities['440308'] = ['盐田区', 'Y'];
// 珠海
$cities['440400'] = ['珠海', 'Z'];
$cities['440402'] = ['香洲区', 'X'];
$cities['440403'] = ['斗门区', 'D'];
$cities['440404'] = ['金湾区', 'J'];
// 汕头
$cities['440500'] = ['汕头', 'S'];
$cities['440507'] = ['龙湖区', 'L'];
$cities['440511'] = ['金平区', 'J'];
$cities['440512'] = ['濠江区', 'J'];
$cities['440513'] = ['潮阳区', 'C'];
$cities['440514'] = ['潮南区', 'C'];
$cities['440515'] = ['澄海区', 'C'];
$cities['440523'] = ['南澳县', 'N'];
// 佛山
$cities['440600'] = ['佛山', 'F'];
$cities['440604'] = ['禅城区', 'C'];
$cities['440605'] = ['南海区', 'N'];
$cities['440606'] = ['顺德区', 'S'];
$cities['440607'] = ['三水区', 'S'];
$cities['440608'] = ['高明区', 'G'];
// 江门
$cities['440700'] = ['江门', 'J'];
$cities['440703'] = ['蓬江区', 'P'];
$cities['440704'] = ['江海区', 'J'];
$cities['440705'] = ['新会区', 'X'];
$cities['440781'] = ['台山市', 'T'];
$cities['440783'] = ['开平市', 'K'];
$cities['440784'] = ['鹤山市', 'H'];
$cities['440785'] = ['恩平市', 'E'];
// 湛江
$cities['440800'] = ['湛江', 'Z'];
$cities['440802'] = ['赤坎区', 'C'];
$cities['440803'] = ['霞山区', 'X'];
$cities['440804'] = ['坡头区', 'P'];
$cities['440811'] = ['麻章区', 'M'];
$cities['440823'] = ['遂溪县', 'S'];
$cities['440825'] = ['徐闻县', 'X'];
$cities['440881'] = ['廉江市', 'L'];
$cities['440882'] = ['雷州市', 'L'];
$cities['440883'] = ['吴川市', 'W'];
// 茂名
$cities['440900'] = ['茂名', 'M'];
$cities['440902'] = ['茂南区', 'M'];
$cities['440903'] = ['茂港区', 'M'];
$cities['440923'] = ['电白县', 'D'];
$cities['440981'] = ['高州市', 'G'];
$cities['440982'] = ['化州市', 'H'];
$cities['440983'] = ['信宜市', 'X'];
// 肇庆
$cities['441200'] = ['肇庆', 'Z'];
$cities['441202'] = ['端州区', 'D'];
$cities['441203'] = ['鼎湖区', 'D'];
$cities['441223'] = ['广宁县', 'G'];
$cities['441224'] = ['怀集县', 'H'];
$cities['441225'] = ['封开县', 'F'];
$cities['441226'] = ['德庆县', 'D'];
$cities['441283'] = ['高要市', 'G'];
$cities['441284'] = ['四会市', 'S'];
// 惠州
$cities['441300'] = ['惠州', 'H'];
$cities['441302'] = ['惠城区', 'H'];
$cities['441303'] = ['惠阳区', 'H'];
$cities['441322'] = ['博罗县', 'B'];
$cities['441323'] = ['惠东县', 'H'];
$cities['441324'] = ['龙门县', 'L'];
// 梅州
$cities['441400'] = ['梅州', 'M'];
$cities['441402'] = ['梅江区', 'M'];
$cities['441421'] = ['梅县', 'M'];
$cities['441422'] = ['大埔县', 'D'];
$cities['441423'] = ['丰顺县', 'F'];
$cities['441424'] = ['五华县', 'W'];
$cities['441426'] = ['平远县', 'P'];
$cities['441427'] = ['蕉岭县', 'J'];
$cities['441481'] = ['兴宁市', 'X'];
// 汕尾
$cities['441500'] = ['汕尾', 'S'];
$cities['441502'] = ['城区', 'C'];
$cities['441521'] = ['海丰县', 'H'];
$cities['441523'] = ['陆河县', 'L'];
$cities['441581'] = ['陆丰市', 'L'];
// 河源
$cities['441600'] = ['河源', 'H'];
$cities['441602'] = ['源城区', 'Y'];
$cities['441621'] = ['紫金县', 'Z'];
$cities['441622'] = ['龙川县', 'L'];
$cities['441623'] = ['连平县', 'L'];
$cities['441624'] = ['和平县', 'H'];
$cities['441625'] = ['东源县', 'D'];
// 阳江
$cities['441700'] = ['阳江', 'Y'];
$cities['441702'] = ['江城区', 'J'];
$cities['441721'] = ['阳西县', 'Y'];
$cities['441723'] = ['阳东县', 'Y'];
$cities['441781'] = ['阳春市', 'Y'];
// 清远
$cities['441800'] = ['清远', 'Q'];
$cities['441802'] = ['清城区', 'Q'];
$cities['441821'] = ['佛冈县', 'F'];
$cities['441823'] = ['阳山县', 'Y'];
$cities['441825'] = ['连山壮族瑶族自治县', 'L'];
$cities['441826'] = ['连南瑶族自治县', 'L'];
$cities['441827'] = ['清新县', 'Q'];
$cities['441881'] = ['英德市', 'Y'];
$cities['441882'] = ['连州市', 'L'];
// 东莞
$cities['441900'] = ['东莞', 'D'];
// 中山
$cities['442000'] = ['中山', 'Z'];
// 潮州
$cities['445100'] = ['潮州', 'C'];
$cities['445102'] = ['湘桥区', 'X'];
$cities['445121'] = ['潮安县', 'C'];
$cities['445122'] = ['饶平县', 'R'];
// 揭阳
$cities['445200'] = ['揭阳', 'J'];
$cities['445202'] = ['榕城区', 'C'];
$cities['445221'] = ['揭东县', 'J'];
$cities['445222'] = ['揭西县', 'J'];
$cities['445224'] = ['惠来县', 'H'];
$cities['445281'] = ['普宁市', 'P'];
// 云浮
$cities['445300'] = ['云浮', 'Y'];
$cities['445302'] = ['云城区', 'Y'];
$cities['445321'] = ['新兴县', 'X'];
$cities['445322'] = ['郁南县', 'Y'];
$cities['445323'] = ['云安县', 'Y'];
$cities['445381'] = ['罗定市', 'L'];
// 广东省结束
//======================================
// 广西
$cities['450000'] = ['广西', 'G'];
// 南宁
$cities['450100'] = ['南宁', 'N'];
$cities['450102'] = ['兴宁区', 'X'];
$cities['450103'] = ['青秀区', 'Q'];
$cities['450105'] = ['江南区', 'J'];
$cities['450107'] = ['西乡塘区', 'X'];
$cities['450108'] = ['良庆区', 'L'];
$cities['450109'] = ['邕宁区', 'N'];
$cities['450122'] = ['武鸣县', 'W'];
$cities['450123'] = ['隆安县', 'L'];
$cities['450124'] = ['马山县', 'M'];
$cities['450125'] = ['上林县', 'S'];
$cities['450126'] = ['宾阳县', 'B'];
$cities['450127'] = ['横县', 'H'];
// 柳州
$cities['450200'] = ['柳州', 'L'];
$cities['450202'] = ['城中区', 'C'];
$cities['450203'] = ['鱼峰区', 'Y'];
$cities['450204'] = ['柳南区', 'L'];
$cities['450205'] = ['柳北区', 'L'];
$cities['450221'] = ['柳江县', 'L'];
$cities['450222'] = ['柳城县', 'L'];
$cities['450223'] = ['鹿寨县', 'L'];
$cities['450224'] = ['融安县', 'R'];
$cities['450225'] = ['融水苗族自治县', 'R'];
$cities['450226'] = ['三江侗族自治县', 'S'];
// 桂林
$cities['450300'] = ['桂林', 'G'];
$cities['450302'] = ['秀峰区', 'X'];
$cities['450303'] = ['叠彩区', 'D'];
$cities['450304'] = ['象山区', 'X'];
$cities['450305'] = ['七星区', 'Q'];
$cities['450311'] = ['雁山区', 'Y'];
$cities['450321'] = ['阳朔县', 'Y'];
$cities['450322'] = ['临桂县', 'L'];
$cities['450323'] = ['灵川县', 'L'];
$cities['450324'] = ['全州县', 'Q'];
$cities['450325'] = ['兴安县', 'X'];
$cities['450326'] = ['永福县', 'Y'];
$cities['450327'] = ['灌阳县', 'G'];
$cities['450328'] = ['龙胜各族自治县', 'L'];
$cities['450329'] = ['资源县', 'Z'];
$cities['450330'] = ['平乐县', 'P'];
$cities['450331'] = ['荔浦县', 'L'];
$cities['450332'] = ['恭城瑶族自治县', 'G'];
// 梧州
$cities['450400'] = ['梧州', 'W'];
$cities['450403'] = ['万秀区', 'W'];
$cities['450404'] = ['蝶山区', 'D'];
$cities['450405'] = ['长洲区', 'C'];
$cities['450421'] = ['苍梧县', 'C'];
$cities['450422'] = ['藤县', 'T'];
$cities['450423'] = ['蒙山县', 'M'];
$cities['450481'] = ['岑溪市', 'X'];
// 北海
$cities['450500'] = ['北海', 'B'];
$cities['450502'] = ['海城区', 'H'];
$cities['450503'] = ['银海区', 'Y'];
$cities['450512'] = ['铁山港区', 'T'];
$cities['450521'] = ['合浦县', 'H'];
// 防城港
$cities['450600'] = ['防城港', 'F'];
$cities['450602'] = ['港口区', 'G'];
$cities['450603'] = ['防城区', 'F'];
$cities['450621'] = ['上思县', 'S'];
$cities['450681'] = ['东兴市', 'D'];
// 钦州
$cities['450700'] = ['钦州', 'Q'];
$cities['450702'] = ['钦南区', 'Q'];
$cities['450703'] = ['钦北区', 'Q'];
$cities['450721'] = ['灵山县', 'L'];
$cities['450722'] = ['浦北县', 'P'];
// 贵港
$cities['450800'] = ['贵港', 'G'];
$cities['450802'] = ['港北区', 'G'];
$cities['450803'] = ['港南区', 'G'];
$cities['450804'] = ['覃塘区', 'T'];
$cities['450821'] = ['平南县', 'P'];
$cities['450881'] = ['桂平市', 'G'];
// 玉林
$cities['450900'] = ['玉林', 'Y'];
$cities['450902'] = ['玉州区', 'Y'];
$cities['450921'] = ['容县', 'R'];
$cities['450922'] = ['陆川县', 'L'];
$cities['450923'] = ['博白县', 'B'];
$cities['450924'] = ['兴业县', 'X'];
$cities['450981'] = ['北流市', 'B'];
// 百色
$cities['451000'] = ['百色', 'B'];
$cities['451002'] = ['右江区', 'Y'];
$cities['451021'] = ['田阳县', 'T'];
$cities['451022'] = ['田东县', 'T'];
$cities['451023'] = ['平果县', 'P'];
$cities['451024'] = ['德保县', 'D'];
$cities['451025'] = ['靖西县', 'J'];
$cities['451026'] = ['那坡县', 'N'];
$cities['451027'] = ['凌云县', 'L'];
$cities['451028'] = ['乐业县', 'L'];
$cities['451029'] = ['田林县', 'T'];
$cities['451030'] = ['西林县', 'X'];
$cities['451031'] = ['隆林各族自治县', 'L'];
// 贺州
$cities['451100'] = ['贺州', 'H'];
$cities['451102'] = ['八步区', 'B'];
$cities['451121'] = ['昭平县', 'Z'];
$cities['451122'] = ['钟山县', 'Z'];
$cities['451123'] = ['富川瑶族自治县', 'F'];
// 河池
$cities['451200'] = ['河池', 'H'];
$cities['451202'] = ['金城江区', 'J'];
$cities['451221'] = ['南丹县', 'N'];
$cities['451222'] = ['天峨县', 'T'];
$cities['451223'] = ['凤山县', 'F'];
$cities['451224'] = ['东兰县', 'D'];
$cities['451225'] = ['罗城仫佬族自治县', 'L'];
$cities['451226'] = ['环江毛南族自治县', 'H'];
$cities['451227'] = ['巴马瑶族自治县', 'B'];
$cities['451228'] = ['都安瑶族自治县', 'D'];
$cities['451229'] = ['大化瑶族自治县', 'D'];
$cities['451281'] = ['宜州市', 'Y'];
// 来宾
$cities['451300'] = ['来宾', 'L'];
$cities['451302'] = ['兴宾区', 'X'];
$cities['451321'] = ['忻城县', 'X'];
$cities['451322'] = ['象州县', 'X'];
$cities['451323'] = ['武宣县', 'W'];
$cities['451324'] = ['金秀瑶族自治县', 'J'];
$cities['451381'] = ['合山市', 'H'];
// 崇左
$cities['451400'] = ['崇左', 'C'];
$cities['451402'] = ['江洲区', 'J'];
$cities['451421'] = ['扶绥县', 'F'];
$cities['451422'] = ['宁明县', 'N'];
$cities['451423'] = ['龙州县', 'L'];
$cities['451424'] = ['大新县', 'D'];
$cities['451425'] = ['天等县', 'T'];
$cities['451481'] = ['凭祥市', 'P'];
// 广西结束
//======================================
// 海南省
$cities['460000'] = ['海南省', 'H'];
// 海口
$cities['460100'] = ['海口', 'H'];
$cities['460105'] = ['秀英区', 'X'];
$cities['460106'] = ['龙华区', 'L'];
$cities['460107'] = ['琼山区', 'Q'];
$cities['460108'] = ['美兰区', 'M'];
// 三亚
$cities['460200'] = ['三亚', 'S'];
// 中沙群岛
$cities['469039'] = ['中沙群岛', 'Z'];
// 海南省结束
//======================================
// 重庆市
$cities['500000'] = ['重庆', 'Z'];
// 重庆
$cities['500100'] = ['万州区', 'W'];
$cities['500200'] = ['涪陵区', 'F'];
$cities['500300'] = ['渝中区', 'Y'];
$cities['500400'] = ['大渡口区', 'D'];
$cities['500500'] = ['江北区', 'J'];
$cities['500600'] = ['沙坪坝区', 'S'];
$cities['500700'] = ['九龙坡区', 'J'];
$cities['500800'] = ['南岸区', 'N'];
$cities['500900'] = ['北碚区', 'B'];
$cities['501000'] = ['万盛区', 'W'];
$cities['501100'] = ['双桥区', 'S'];
$cities['501200'] = ['渝北区', 'Y'];
$cities['501300'] = ['巴南区', 'B'];
$cities['501400'] = ['黔江区', 'Q'];
$cities['501500'] = ['长寿区', 'C'];
$cities['502200'] = ['綦江县', 'J'];
$cities['502300'] = ['潼南县', 'N'];
$cities['502400'] = ['铜梁县', 'T'];
$cities['502500'] = ['大足县', 'D'];
$cities['502600'] = ['荣昌县', 'R'];
$cities['502700'] = ['璧山县', 'S'];
$cities['502800'] = ['梁平县', 'L'];
$cities['502900'] = ['城口县', 'C'];
$cities['503000'] = ['丰都县', 'F'];
$cities['503100'] = ['垫江县', 'D'];
$cities['503200'] = ['武隆县', 'W'];
$cities['503300'] = ['忠县', 'Z'];
$cities['503400'] = ['开县', 'K'];
$cities['503500'] = ['云阳县', 'Y'];
$cities['503600'] = ['奉节县', 'F'];
$cities['503700'] = ['巫山县', 'W'];
$cities['503800'] = ['巫溪县', 'W'];
$cities['504000'] = ['石柱土家族自治县', 'S'];
$cities['504100'] = ['秀山土家族苗族自治县', 'X'];
$cities['504200'] = ['酉阳土家族苗族自治县', 'Y'];
$cities['504300'] = ['彭水苗族土家族自治县', 'P'];
$cities['508100'] = ['江津市', 'J'];
$cities['508200'] = ['合川市', 'H'];
$cities['508300'] = ['永川市', 'Y'];
$cities['508400'] = ['南川市', 'N'];
// 重庆市结束
//======================================
// 四川省
$cities['510000'] = ['四川省', 'S'];
// 成都
$cities['510100'] = ['成都', 'C'];
$cities['510104'] = ['锦江区', 'J'];
$cities['510105'] = ['青羊区', 'Q'];
$cities['510106'] = ['金牛区', 'J'];
$cities['510107'] = ['武侯区', 'W'];
$cities['510108'] = ['成华区', 'C'];
$cities['510112'] = ['龙泉驿区', 'L'];
$cities['510113'] = ['青白江区', 'Q'];
$cities['510114'] = ['新都区', 'X'];
$cities['510115'] = ['温江区', 'W'];
$cities['510121'] = ['金堂县', 'J'];
$cities['510122'] = ['双流县', 'S'];
$cities['510124'] = ['郫县', 'X'];
$cities['510129'] = ['大邑县', 'D'];
$cities['510131'] = ['蒲江县', 'P'];
$cities['510132'] = ['新津县', 'X'];
$cities['510181'] = ['都江堰市', 'D'];
$cities['510182'] = ['彭州市', 'P'];
$cities['510183'] = ['邛崃市', 'S'];
$cities['510184'] = ['崇州市', 'C'];
// 自贡
$cities['510300'] = ['自贡', 'Z'];
$cities['510302'] = ['自流井区', 'Z'];
$cities['510303'] = ['贡井区', 'G'];
$cities['510304'] = ['大安区', 'D'];
$cities['510311'] = ['沿滩区', 'Y'];
$cities['510321'] = ['荣县', 'R'];
$cities['510322'] = ['富顺县', 'F'];
// 攀枝花
$cities['510400'] = ['攀枝花', 'P'];
$cities['510402'] = ['东区', 'D'];
$cities['510403'] = ['西区', 'X'];
$cities['510411'] = ['仁和区', 'R'];
$cities['510421'] = ['米易县', 'M'];
$cities['510422'] = ['盐边县', 'Y'];
// 泸州
$cities['510500'] = ['泸州', 'Z'];
$cities['510502'] = ['江阳区', 'J'];
$cities['510503'] = ['纳溪区', 'N'];
$cities['510504'] = ['龙马潭区', 'L'];
$cities['510521'] = ['泸县', 'X'];
$cities['510522'] = ['合江县', 'H'];
$cities['510524'] = ['叙永县', 'X'];
$cities['510525'] = ['古蔺县', 'G'];
// 德阳
$cities['510600'] = ['德阳', 'D'];
$cities['510603'] = ['旌阳区', 'Y'];
$cities['510623'] = ['中江县', 'Z'];
$cities['510626'] = ['罗江县', 'L'];
$cities['510681'] = ['广汉市', 'G'];
$cities['510682'] = ['什邡市', 'S'];
$cities['510683'] = ['绵竹市', 'M'];
// 绵阳
$cities['510700'] = ['绵阳', 'M'];
$cities['510703'] = ['涪城区', 'F'];
$cities['510704'] = ['游仙区', 'Y'];
$cities['510722'] = ['三台县', 'S'];
$cities['510723'] = ['盐亭县', 'Y'];
$cities['510724'] = ['安县', 'A'];
$cities['510725'] = ['梓潼县', 'X'];
$cities['510726'] = ['北川羌族自治县', 'B'];
$cities['510727'] = ['平武县', 'P'];
$cities['510781'] = ['江油市', 'J'];
// 广元
$cities['510800'] = ['广元', 'G'];
$cities['510802'] = ['利州区', 'L'];
$cities['510811'] = ['元坝区', 'Y'];
$cities['510812'] = ['朝天区', 'C'];
$cities['510821'] = ['旺苍县', 'W'];
$cities['510822'] = ['青川县', 'Q'];
$cities['510823'] = ['剑阁县', 'J'];
$cities['510824'] = ['苍溪县', 'C'];
// 遂宁
$cities['510900'] = ['遂宁', 'S'];
$cities['510903'] = ['船山区', 'C'];
$cities['510904'] = ['安居区', 'A'];
$cities['510921'] = ['蓬溪县', 'P'];
$cities['510922'] = ['射洪县', 'S'];
$cities['510923'] = ['大英县', 'D'];
// 内江
$cities['511000'] = ['内江', 'N'];
$cities['511002'] = ['市中区', 'S'];
$cities['511011'] = ['东兴区', 'D'];
$cities['511024'] = ['威远县', 'W'];
$cities['511025'] = ['资中县', 'Z'];
$cities['511028'] = ['隆昌县', 'L'];
// 乐山
$cities['511100'] = ['乐山', 'L'];
$cities['511102'] = ['市中区', 'S'];
$cities['511111'] = ['沙湾区', 'S'];
$cities['511112'] = ['五通桥区', 'W'];
$cities['511113'] = ['金口河区', 'J'];
$cities['511123'] = ['犍为县', 'W'];
$cities['511124'] = ['井研县', 'J'];
$cities['511126'] = ['夹江县', 'J'];
$cities['511129'] = ['沐川县', 'C'];
$cities['511132'] = ['峨边彝族自治县', 'E'];
$cities['511133'] = ['马边彝族自治县', 'M'];
$cities['511181'] = ['峨眉山市', 'E'];
// 南充
$cities['511300'] = ['南充', 'N'];
$cities['511302'] = ['顺庆区', 'S'];
$cities['511303'] = ['高坪区', 'G'];
$cities['511304'] = ['嘉陵区', 'J'];
$cities['511321'] = ['南部县', 'N'];
$cities['511322'] = ['营山县', 'Y'];
$cities['511323'] = ['蓬安县', 'P'];
$cities['511324'] = ['仪陇县', 'Y'];
$cities['511325'] = ['西充县', 'X'];
$cities['511381'] = ['阆中市', 'Z'];
// 眉山
$cities['511400'] = ['眉山', 'M'];
$cities['511402'] = ['东坡区', 'D'];
$cities['511421'] = ['仁寿县', 'R'];
$cities['511422'] = ['彭山县', 'P'];
$cities['511423'] = ['洪雅县', 'H'];
$cities['511424'] = ['丹棱县', 'D'];
$cities['511425'] = ['青神县', 'Q'];
// 宜宾
$cities['511500'] = ['宜宾', 'Y'];
$cities['511502'] = ['翠屏区', 'C'];
$cities['511521'] = ['宜宾县', 'Y'];
$cities['511522'] = ['南溪县', 'N'];
$cities['511523'] = ['江安县', 'J'];
$cities['511524'] = ['长宁县', 'C'];
$cities['511525'] = ['高县', 'G'];
$cities['511526'] = ['珙县', 'X'];
$cities['511527'] = ['筠连县', 'L'];
$cities['511528'] = ['兴文县', 'X'];
$cities['511529'] = ['屏山县', 'P'];
// 广安
$cities['511600'] = ['广安', 'G'];
$cities['511602'] = ['广安区', 'G'];
$cities['511621'] = ['岳池县', 'Y'];
$cities['511622'] = ['武胜县', 'W'];
$cities['511623'] = ['邻水县', 'L'];
$cities['511681'] = ['华莹市', 'H'];
// 达州
$cities['511700'] = ['达州', 'D'];
$cities['511702'] = ['通川区', 'T'];
$cities['511721'] = ['达县', 'D'];
$cities['511722'] = ['宣汉县', 'X'];
$cities['511723'] = ['开江县', 'K'];
$cities['511724'] = ['大竹县', 'D'];
$cities['511725'] = ['渠县', 'Q'];
$cities['511781'] = ['万源市', 'W'];
// 雅安
$cities['511800'] = ['雅安', 'Y'];
$cities['511802'] = ['雨城区', 'Y'];
$cities['511821'] = ['名山县', 'M'];
$cities['511822'] = ['荥经县', 'J'];
$cities['511823'] = ['汉源县', 'H'];
$cities['511824'] = ['石棉县', 'S'];
$cities['511825'] = ['天全县', 'T'];
$cities['511826'] = ['芦山县', 'L'];
$cities['511827'] = ['宝兴县', 'B'];
// 巴中
$cities['511900'] = ['巴中', 'B'];
$cities['511902'] = ['巴州区', 'B'];
$cities['511921'] = ['通江县', 'T'];
$cities['511922'] = ['南江县', 'N'];
$cities['511923'] = ['平昌县', 'P'];
// 资阳
$cities['512000'] = ['资阳', 'Z'];
$cities['512002'] = ['雁江区', 'Y'];
$cities['512021'] = ['安岳县', 'A'];
$cities['512022'] = ['乐至县', 'L'];
$cities['512081'] = ['简阳市', 'J'];
// 阿坝
$cities['513200'] = ['阿坝', 'A'];
$cities['513221'] = ['汶川县', 'C'];
$cities['513222'] = ['理县', 'L'];
$cities['513223'] = ['茂县', 'M'];
$cities['513224'] = ['松潘县', 'S'];
$cities['513225'] = ['九寨沟县', 'J'];
$cities['513226'] = ['金川县', 'J'];
$cities['513227'] = ['小金县', 'X'];
$cities['513228'] = ['黑水县', 'H'];
$cities['513229'] = ['马尔康县', 'M'];
$cities['513230'] = ['壤塘县', 'R'];
$cities['513231'] = ['阿坝县', 'A'];
$cities['513232'] = ['若尔盖县', 'R'];
$cities['513233'] = ['红原县', 'H'];
// 甘孜
$cities['513300'] = ['甘孜', 'G'];
$cities['513321'] = ['康定县', 'K'];
$cities['513322'] = ['泸定县', 'D'];
$cities['513323'] = ['丹巴县', 'D'];
$cities['513324'] = ['九龙县', 'J'];
$cities['513325'] = ['雅江县', 'Y'];
$cities['513326'] = ['道孚县', 'D'];
$cities['513327'] = ['炉霍县', 'L'];
$cities['513328'] = ['甘孜县', 'G'];
$cities['513329'] = ['新龙县', 'X'];
$cities['513330'] = ['德格县', 'D'];
$cities['513331'] = ['白玉县', 'B'];
$cities['513332'] = ['石渠县', 'S'];
$cities['513333'] = ['色达县', 'S'];
$cities['513334'] = ['理塘县', 'L'];
$cities['513335'] = ['巴塘县', 'B'];
$cities['513336'] = ['乡城县', 'X'];
$cities['513337'] = ['稻城县', 'D'];
$cities['513338'] = ['得荣县', 'D'];
// 凉山
$cities['513400'] = ['凉山', 'L'];
$cities['513401'] = ['西昌市', 'X'];
$cities['513422'] = ['木里藏族自治县', 'M'];
$cities['513423'] = ['盐源县', 'Y'];
$cities['513424'] = ['德昌县', 'D'];
$cities['513425'] = ['会理县', 'H'];
$cities['513426'] = ['会东县', 'H'];
$cities['513427'] = ['宁南县', 'N'];
$cities['513428'] = ['普格县', 'P'];
$cities['513429'] = ['布拖县', 'B'];
$cities['513430'] = ['金阳县', 'J'];
$cities['513431'] = ['昭觉县', 'Z'];
$cities['513432'] = ['喜德县', 'X'];
$cities['513433'] = ['冕宁县', 'M'];
$cities['513434'] = ['越西县', 'Y'];
$cities['513435'] = ['甘洛县', 'G'];
$cities['513436'] = ['美姑县', 'M'];
$cities['513437'] = ['雷波县', 'L'];
// 四川省结束
//======================================
// 贵州省
$cities['520000'] = ['贵州省', 'G'];
// 贵阳
$cities['520100'] = ['贵阳', 'G'];
$cities['520102'] = ['南明区', 'N'];
$cities['520103'] = ['云岩区', 'Y'];
$cities['520111'] = ['花溪区', 'H'];
$cities['520112'] = ['乌当区', 'W'];
$cities['520113'] = ['白云区', 'B'];
$cities['520114'] = ['小河区', 'X'];
$cities['520121'] = ['开阳县', 'K'];
$cities['520122'] = ['息烽县', 'X'];
$cities['520123'] = ['修文县', 'X'];
$cities['520181'] = ['清镇市', 'Q'];
// 六盘水
$cities['520200'] = ['六盘水', 'L'];
$cities['520201'] = ['钟山区', 'Z'];
$cities['520203'] = ['六枝特区', 'L'];
$cities['520221'] = ['水城县', 'S'];
$cities['520222'] = ['盘县', 'P'];
// 遵义
$cities['520300'] = ['遵义', 'Z'];
$cities['520302'] = ['红花岗区', 'H'];
$cities['520303'] = ['汇川区', 'H'];
$cities['520321'] = ['遵义县', 'Z'];
$cities['520322'] = ['桐梓县', 'T'];
$cities['520323'] = ['绥阳县', 'S'];
$cities['520324'] = ['正安县', 'Z'];
$cities['520325'] = ['道真仡佬族苗族自治县', 'D'];
$cities['520326'] = ['务川仡佬族苗族自治县', 'W'];
$cities['520327'] = ['凤冈县', 'F'];
$cities['520328'] = ['湄潭县', 'T'];
$cities['520329'] = ['余庆县', 'Y'];
$cities['520330'] = ['习水县', 'X'];
$cities['520381'] = ['赤水市', 'C'];
$cities['520382'] = ['仁怀市', 'R'];
// 安顺
$cities['520400'] = ['安顺', 'A'];
$cities['520402'] = ['西秀区', 'X'];
$cities['520421'] = ['平坝县', 'P'];
$cities['520422'] = ['普定县', 'P'];
$cities['520423'] = ['镇宁布依族苗族自治县', 'Z'];
$cities['520424'] = ['关岭布依族苗族自治县', 'G'];
$cities['520425'] = ['紫云苗族布依族自治县', 'Z'];
// 铜仁
$cities['522200'] = ['铜仁', 'T'];
$cities['522201'] = ['铜仁市', 'T'];
$cities['522222'] = ['江口县', 'J'];
$cities['522223'] = ['玉屏侗族自治县', 'Y'];
$cities['522224'] = ['石阡县', 'S'];
$cities['522225'] = ['思南县', 'S'];
$cities['522226'] = ['印江土家族苗族自治县', 'Y'];
$cities['522227'] = ['德江县', 'D'];
$cities['522228'] = ['沿河土家族自治县', 'Y'];
$cities['522229'] = ['松桃苗族自治县', 'S'];
$cities['522230'] = ['万山特区', 'W'];
// 黔西南
$cities['522300'] = ['黔西南', 'Q'];
$cities['522301'] = ['兴义市', 'X'];
$cities['522322'] = ['兴仁县', 'X'];
$cities['522323'] = ['普安县', 'P'];
$cities['522324'] = ['晴隆县', 'Q'];
$cities['522325'] = ['贞丰县', 'Z'];
$cities['522326'] = ['望谟县', 'W'];
$cities['522327'] = ['册亨县', 'C'];
$cities['522328'] = ['安龙县', 'A'];
// 毕节
$cities['522400'] = ['毕节', 'B'];
$cities['522401'] = ['毕节市', 'B'];
$cities['522422'] = ['大方县', 'D'];
$cities['522423'] = ['黔西县', 'Q'];
$cities['522424'] = ['金沙县', 'J'];
$cities['522425'] = ['织金县', 'Z'];
$cities['522426'] = ['纳雍县', 'N'];
$cities['522427'] = ['威宁彝族回族苗族自治县', 'W'];
$cities['522428'] = ['赫章县', 'H'];
// 黔东南
$cities['522600'] = ['黔东南', 'Q'];
$cities['522601'] = ['凯里市', 'K'];
$cities['522622'] = ['黄平县', 'H'];
$cities['522623'] = ['施秉县', 'S'];
$cities['522624'] = ['三穗县', 'S'];
$cities['522625'] = ['镇远县', 'Z'];
$cities['522626'] = ['岑巩县', 'G'];
$cities['522627'] = ['天柱县', 'T'];
$cities['522628'] = ['锦屏县', 'J'];
$cities['522629'] = ['剑河县', 'J'];
$cities['522630'] = ['台江县', 'T'];
$cities['522631'] = ['黎平县', 'L'];
$cities['522632'] = ['榕江县', 'J'];
$cities['522633'] = ['从江县', 'C'];
$cities['522634'] = ['雷山县', 'L'];
$cities['522635'] = ['麻江县', 'M'];
$cities['522636'] = ['丹寨县', 'D'];
// 黔南
$cities['522700'] = ['黔南', 'Q'];
$cities['522701'] = ['都匀市', 'D'];
$cities['522702'] = ['福泉市', 'F'];
$cities['522722'] = ['荔波县', 'L'];
$cities['522723'] = ['贵定县', 'G'];
$cities['522725'] = ['瓮安县', 'W'];
$cities['522726'] = ['独山县', 'D'];
$cities['522727'] = ['平塘县', 'P'];
$cities['522728'] = ['罗甸县', 'L'];
$cities['522729'] = ['长顺县', 'C'];
$cities['522730'] = ['龙里县', 'L'];
$cities['522731'] = ['惠水县', 'H'];
$cities['522732'] = ['三都水族自治县', 'S'];
// 贵州省结束
//======================================
// 云南省
$cities['530000'] = ['云南省', 'Y'];
// 昆明
$cities['530100'] = ['昆明', 'K'];
$cities['530102'] = ['五华区', 'W'];
$cities['530103'] = ['盘龙区', 'P'];
$cities['530111'] = ['官渡区', 'G'];
$cities['530112'] = ['西山区', 'X'];
$cities['530113'] = ['东川区', 'D'];
$cities['530121'] = ['呈贡县', 'C'];
$cities['530122'] = ['晋宁县', 'J'];
$cities['530124'] = ['富民县', 'F'];
$cities['530125'] = ['宜良县', 'Y'];
$cities['530126'] = ['石林彝族自治县', 'S'];
$cities['530127'] = ['嵩明县', 'M'];
$cities['530128'] = ['禄劝彝族苗族自治县', 'L'];
$cities['530129'] = ['寻甸回族彝族自治县', 'X'];
$cities['530181'] = ['安宁市', 'A'];
// 曲靖
$cities['530300'] = ['曲靖', 'Q'];
$cities['530302'] = ['麒麟区', 'Q'];
$cities['530321'] = ['马龙县', 'M'];
$cities['530322'] = ['陆良县', 'L'];
$cities['530323'] = ['师宗县', 'S'];
$cities['530324'] = ['罗平县', 'L'];
$cities['530325'] = ['富源县', 'F'];
$cities['530326'] = ['会泽县', 'H'];
$cities['530328'] = ['沾益县', 'Z'];
$cities['530381'] = ['宣威市', 'X'];
// 玉溪
$cities['530400'] = ['玉溪', 'Y'];
$cities['530402'] = ['红塔区', 'H'];
$cities['530421'] = ['江川县', 'J'];
$cities['530422'] = ['澄江县', 'C'];
$cities['530423'] = ['通海县', 'T'];
$cities['530424'] = ['华宁县', 'H'];
$cities['530425'] = ['易门县', 'Y'];
$cities['530426'] = ['峨山彝族自治县', 'E'];
$cities['530427'] = ['新平彝族傣族自治县', 'X'];
$cities['530428'] = ['元江哈尼族彝族傣族自治县', 'Y'];
// 保山
$cities['530500'] = ['保山', 'B'];
$cities['530502'] = ['隆阳区', 'L'];
$cities['530521'] = ['施甸县', 'S'];
$cities['530522'] = ['腾冲县', 'T'];
$cities['530523'] = ['龙陵县', 'L'];
$cities['530524'] = ['昌宁县', 'C'];
// 昭通
$cities['530600'] = ['昭通', 'Z'];
$cities['530602'] = ['昭阳区', 'Z'];
$cities['530621'] = ['鲁甸县', 'L'];
$cities['530622'] = ['巧家县', 'Q'];
$cities['530623'] = ['盐津县', 'Y'];
$cities['530624'] = ['大关县', 'D'];
$cities['530625'] = ['永善县', 'Y'];
$cities['530626'] = ['绥江县', 'S'];
$cities['530627'] = ['镇雄县', 'Z'];
$cities['530628'] = ['彝良县', 'Y'];
$cities['530629'] = ['威信县', 'W'];
$cities['530630'] = ['水富县', 'S'];
// 丽江
$cities['530700'] = ['丽江', 'L'];
$cities['530702'] = ['古城区', 'G'];
$cities['530721'] = ['玉龙纳西族自治县', 'Y'];
$cities['530722'] = ['永胜县', 'Y'];
$cities['530723'] = ['华坪县', 'H'];
$cities['530724'] = ['宁蒗彝族自治县', 'N'];
// 普洱
$cities['530800'] = ['普洱', 'P'];
$cities['530802'] = ['翠云区', 'C'];
$cities['530821'] = ['普洱哈尼族彝族自治县', 'P'];
$cities['530822'] = ['墨江哈尼族自治县', 'M'];
$cities['530823'] = ['景东彝族自治县', 'J'];
$cities['530824'] = ['景谷傣族彝族自治县', 'J'];
$cities['530825'] = ['镇沅彝族哈尼族拉祜族自治县', 'Z'];
$cities['530826'] = ['江城哈尼族彝族自治县', 'J'];
$cities['530827'] = ['孟连傣族拉祜族佤族自治县', 'M'];
$cities['530828'] = ['澜沧拉祜族自治县', 'L'];
$cities['530829'] = ['西盟佤族自治县', 'X'];
// 临沧
$cities['530900'] = ['临沧', 'L'];
$cities['530902'] = ['临翔区', 'L'];
$cities['530921'] = ['凤庆县', 'F'];
$cities['530922'] = ['云县', 'Y'];
$cities['530923'] = ['永德县', 'Y'];
$cities['530924'] = ['镇康县', 'Z'];
$cities['530925'] = ['双江县', 'S'];
$cities['530926'] = ['耿马傣族佤族自治县', 'G'];
$cities['530927'] = ['沧源佤族自治县', 'C'];
// 楚雄
$cities['532300'] = ['楚雄', 'C'];
$cities['532301'] = ['楚雄市', 'C'];
$cities['532322'] = ['双柏县', 'S'];
$cities['532323'] = ['牟定县', 'M'];
$cities['532324'] = ['南华县', 'N'];
$cities['532325'] = ['姚安县', 'Y'];
$cities['532326'] = ['大姚县', 'D'];
$cities['532327'] = ['永仁县', 'Y'];
$cities['532328'] = ['元谋县', 'Y'];
$cities['532329'] = ['武定县', 'W'];
$cities['532331'] = ['禄丰县', 'L'];
// 红河
$cities['532500'] = ['红河', 'H'];
$cities['532501'] = ['个旧市', 'G'];
$cities['532502'] = ['开远市', 'K'];
$cities['532522'] = ['蒙自县', 'M'];
$cities['532523'] = ['屏边苗族自治县', 'P'];
$cities['532524'] = ['建水县', 'J'];
$cities['532525'] = ['石屏县', 'S'];
$cities['532526'] = ['弥勒县', 'M'];
$cities['532527'] = ['泸西县', 'X'];
$cities['532528'] = ['元阳县', 'Y'];
$cities['532529'] = ['红河县', 'H'];
$cities['532530'] = ['金平苗族瑶族傣族自治县', 'J'];
$cities['532531'] = ['绿春县', 'L'];
$cities['532532'] = ['河口瑶族自治县', 'H'];
// 文山
$cities['532600'] = ['文山', 'W'];
$cities['532621'] = ['文山县', 'W'];
$cities['532622'] = ['砚山县', 'Y'];
$cities['532623'] = ['西畴县', 'X'];
$cities['532624'] = ['麻栗坡县', 'M'];
$cities['532625'] = ['马关县', 'M'];
$cities['532626'] = ['丘北县', 'Q'];
$cities['532627'] = ['广南县', 'G'];
$cities['532628'] = ['富宁县', 'F'];
// 西双版纳
$cities['532800'] = ['西双版纳', 'X'];
$cities['532801'] = ['景洪市', 'J'];
$cities['532822'] = ['勐海县', 'H'];
$cities['532823'] = ['勐腊县', 'L'];
// 大理
$cities['532900'] = ['大理', 'D'];
$cities['532901'] = ['大理市', 'D'];
$cities['532922'] = ['漾濞彝族自治县', 'Y'];
$cities['532923'] = ['祥云县', 'X'];
$cities['532924'] = ['宾川县', 'B'];
$cities['532925'] = ['弥渡县', 'M'];
$cities['532926'] = ['南涧彝族自治县', 'N'];
$cities['532927'] = ['巍山彝族回族自治县', 'W'];
$cities['532928'] = ['永平县', 'Y'];
$cities['532929'] = ['云龙县', 'Y'];
$cities['532930'] = ['洱源县', 'E'];
$cities['532931'] = ['剑川县', 'J'];
$cities['532932'] = ['鹤庆县', 'H'];
// 德宏
$cities['533100'] = ['德宏', 'D'];
$cities['533102'] = ['瑞丽市', 'R'];
$cities['533103'] = ['潞西市', 'L'];
$cities['533122'] = ['梁河县', 'L'];
$cities['533123'] = ['盈江县', 'Y'];
$cities['533124'] = ['陇川县', 'L'];
// 怒江
$cities['533300'] = ['怒江', 'N'];
$cities['533321'] = ['泸水县', 'S'];
$cities['533323'] = ['福贡县', 'F'];
$cities['533324'] = ['贡山独龙族怒族自治县', 'G'];
$cities['533325'] = ['兰坪白族普米族自治县', 'L'];
// 迪庆
$cities['533400'] = ['迪庆', 'D'];
$cities['533421'] = ['香格里拉县', 'X'];
$cities['533422'] = ['德钦县', 'D'];
$cities['533423'] = ['维西傈僳族自治县', 'W'];
// 云南省结束
//======================================
// 西藏
$cities['540000'] = ['西藏', 'X'];
// 拉萨
$cities['540100'] = ['拉萨', 'L'];
$cities['540102'] = ['城关区', 'C'];
$cities['540121'] = ['林周县', 'L'];
$cities['540122'] = ['当雄县', 'D'];
$cities['540123'] = ['尼木县', 'N'];
$cities['540124'] = ['曲水县', 'Q'];
$cities['540125'] = ['堆龙德庆县', 'D'];
$cities['540126'] = ['达孜县', 'D'];
$cities['540127'] = ['墨竹工卡县', 'M'];
// 昌都
$cities['542100'] = ['昌都', 'C'];
$cities['542121'] = ['昌都县', 'C'];
$cities['542122'] = ['江达县', 'J'];
$cities['542123'] = ['贡觉县', 'G'];
$cities['542124'] = ['类乌齐县', 'L'];
$cities['542125'] = ['丁青县', 'D'];
$cities['542126'] = ['察雅县', 'C'];
$cities['542127'] = ['八宿县', 'B'];
$cities['542128'] = ['左贡县', 'Z'];
$cities['542129'] = ['芒康县', 'M'];
$cities['542132'] = ['洛隆县', 'L'];
$cities['542133'] = ['边坝县', 'B'];
// 山南
$cities['542200'] = ['山南', 'S'];
$cities['542221'] = ['乃东县', 'N'];
$cities['542222'] = ['扎囊县', 'Z'];
$cities['542223'] = ['贡嘎县', 'G'];
$cities['542224'] = ['桑日县', 'S'];
$cities['542225'] = ['琼结县', 'Q'];
$cities['542226'] = ['曲松县', 'Q'];
$cities['542227'] = ['措美县', 'C'];
$cities['542228'] = ['洛扎县', 'L'];
$cities['542229'] = ['加查县', 'J'];
$cities['542231'] = ['隆子县', 'L'];
$cities['542232'] = ['错那县', 'C'];
$cities['542233'] = ['浪卡子县', 'L'];
// 日喀则
$cities['542300'] = ['日喀则', 'R'];
$cities['542301'] = ['日喀则市', 'R'];
$cities['542322'] = ['南木林县', 'N'];
$cities['542323'] = ['江孜县', 'J'];
$cities['542324'] = ['定日县', 'D'];
$cities['542325'] = ['萨迦县', 'S'];
$cities['542326'] = ['拉孜县', 'L'];
$cities['542327'] = ['昂仁县', 'A'];
$cities['542328'] = ['谢通门县', 'X'];
$cities['542329'] = ['白朗县', 'B'];
$cities['542330'] = ['仁布县', 'R'];
$cities['542331'] = ['康马县', 'K'];
$cities['542332'] = ['定结县', 'D'];
$cities['542333'] = ['仲巴县', 'Z'];
$cities['542334'] = ['亚东县', 'Y'];
$cities['542335'] = ['吉隆县', 'J'];
$cities['542336'] = ['聂拉木县', 'N'];
$cities['542337'] = ['萨嘎县', 'S'];
$cities['542338'] = ['岗巴县', 'G'];
// 那曲
$cities['542400'] = ['那曲', 'N'];
$cities['542421'] = ['那曲县', 'N'];
$cities['542422'] = ['嘉黎县', 'J'];
$cities['542423'] = ['比如县', 'B'];
$cities['542424'] = ['聂荣县', 'N'];
$cities['542425'] = ['安多县', 'A'];
$cities['542426'] = ['申扎县', 'S'];
$cities['542427'] = ['索县', 'S'];
$cities['542428'] = ['班戈县', 'B'];
$cities['542429'] = ['巴青县', 'B'];
$cities['542430'] = ['尼玛县', 'N'];
// 阿里
$cities['542500'] = ['阿里', 'A'];
$cities['542521'] = ['普兰县', 'P'];
$cities['542522'] = ['札达县', 'Z'];
$cities['542523'] = ['噶尔县', 'G'];
$cities['542524'] = ['日土县', 'R'];
$cities['542525'] = ['革吉县', 'G'];
$cities['542526'] = ['改则县', 'G'];
$cities['542527'] = ['措勤县', 'C'];
// 林芝
$cities['542600'] = ['林芝', 'L'];
$cities['542621'] = ['林芝县', 'L'];
$cities['542622'] = ['工布江达县', 'G'];
$cities['542623'] = ['米林县', 'M'];
$cities['542624'] = ['墨脱县', 'M'];
$cities['542625'] = ['波密县', 'B'];
$cities['542626'] = ['察隅县', 'C'];
$cities['542627'] = ['朗县', 'L'];
// 西藏结束
//======================================
// 陕西省
$cities['610000'] = ['陕西省', 'S'];
// 西安
$cities['610100'] = ['西安', 'X'];
$cities['610102'] = ['新城区', 'X'];
$cities['610103'] = ['碑林区', 'B'];
$cities['610104'] = ['莲湖区', 'L'];
$cities['610111'] = ['灞桥区', 'Q'];
$cities['610112'] = ['未央区', 'W'];
$cities['610113'] = ['雁塔区', 'Y'];
$cities['610114'] = ['阎良区', 'Y'];
$cities['610115'] = ['临潼区', 'L'];
$cities['610116'] = ['长安区', 'C'];
$cities['610122'] = ['蓝田县', 'L'];
$cities['610124'] = ['周至县', 'Z'];
$cities['610125'] = ['户县', 'H'];
$cities['610126'] = ['高陵县', 'G'];
// 铜川
$cities['610200'] = ['铜川', 'T'];
$cities['610202'] = ['王益区', 'W'];
$cities['610203'] = ['印台区', 'Y'];
$cities['610204'] = ['耀州区', 'Y'];
$cities['610222'] = ['宜君县', 'Y'];
// 宝鸡
$cities['610300'] = ['宝鸡', 'B'];
$cities['610302'] = ['渭滨区', 'W'];
$cities['610303'] = ['金台区', 'J'];
$cities['610304'] = ['陈仓区', 'C'];
$cities['610322'] = ['凤翔县', 'F'];
$cities['610323'] = ['岐山县', 'S'];
$cities['610324'] = ['扶风县', 'F'];
$cities['610326'] = ['眉县', 'M'];
$cities['610327'] = ['陇县', 'L'];
$cities['610328'] = ['千阳县', 'Q'];
$cities['610329'] = ['麟游县', 'Y'];
$cities['610330'] = ['凤县', 'F'];
$cities['610331'] = ['太白县', 'T'];
// 咸阳
$cities['610400'] = ['咸阳', 'X'];
$cities['610402'] = ['秦都区', 'Q'];
$cities['610403'] = ['杨凌区', 'Y'];
$cities['610404'] = ['渭城区', 'W'];
$cities['610422'] = ['三原县', 'S'];
$cities['610423'] = ['泾阳县', 'Y'];
$cities['610424'] = ['乾县', 'Q'];
$cities['610425'] = ['礼泉县', 'L'];
$cities['610426'] = ['永寿县', 'Y'];
$cities['610427'] = ['彬县', 'B'];
$cities['610428'] = ['长武县', 'C'];
$cities['610429'] = ['旬邑县', 'X'];
$cities['610430'] = ['淳化县', 'C'];
$cities['610431'] = ['武功县', 'W'];
$cities['610481'] = ['兴平市', 'X'];
// 渭南
$cities['610500'] = ['渭南', 'W'];
$cities['610502'] = ['临渭区', 'L'];
$cities['610521'] = ['华县', 'H'];
$cities['610522'] = ['潼关县', 'G'];
$cities['610523'] = ['大荔县', 'D'];
$cities['610524'] = ['合阳县', 'H'];
$cities['610525'] = ['澄城县', 'C'];
$cities['610526'] = ['蒲城县', 'P'];
$cities['610527'] = ['白水县', 'B'];
$cities['610528'] = ['富平县', 'F'];
$cities['610581'] = ['韩城市', 'H'];
$cities['610582'] = ['华阴市', 'H'];
// 延安
$cities['610600'] = ['延安', 'Y'];
$cities['610602'] = ['宝塔区', 'B'];
$cities['610621'] = ['延长县', 'Y'];
$cities['610622'] = ['延川县', 'Y'];
$cities['610623'] = ['子长县', 'Z'];
$cities['610624'] = ['安塞县', 'A'];
$cities['610625'] = ['志丹县', 'Z'];
$cities['610626'] = ['吴旗县', 'W'];
$cities['610627'] = ['甘泉县', 'G'];
$cities['610628'] = ['富县', 'F'];
$cities['610629'] = ['洛川县', 'L'];
$cities['610630'] = ['宜川县', 'Y'];
$cities['610631'] = ['黄龙县', 'H'];
$cities['610632'] = ['黄陵县', 'H'];
// 汉中
$cities['610700'] = ['汉中', 'H'];
$cities['610702'] = ['汉台区', 'H'];
$cities['610721'] = ['南郑县', 'N'];
$cities['610722'] = ['城固县', 'C'];
$cities['610723'] = ['洋县', 'Y'];
$cities['610724'] = ['西乡县', 'X'];
$cities['610725'] = ['勉县', 'M'];
$cities['610726'] = ['宁强县', 'N'];
$cities['610727'] = ['略阳县', 'L'];
$cities['610728'] = ['镇巴县', 'Z'];
$cities['610729'] = ['留坝县', 'L'];
$cities['610730'] = ['佛坪县', 'F'];
// 榆林
$cities['610800'] = ['榆林', 'Y'];
$cities['610802'] = ['榆阳区', 'Y'];
$cities['610821'] = ['神木县', 'S'];
$cities['610822'] = ['府谷县', 'F'];
$cities['610823'] = ['横山县', 'H'];
$cities['610824'] = ['靖边县', 'J'];
$cities['610825'] = ['定边县', 'D'];
$cities['610826'] = ['绥德县', 'S'];
$cities['610827'] = ['米脂县', 'M'];
$cities['610828'] = ['佳县', 'J'];
$cities['610829'] = ['吴堡县', 'W'];
$cities['610830'] = ['清涧县', 'Q'];
$cities['610831'] = ['子洲县', 'Z'];
// 安康
$cities['610900'] = ['安康', 'A'];
$cities['610902'] = ['汉滨区', 'H'];
$cities['610921'] = ['汉阴县', 'H'];
$cities['610922'] = ['石泉县', 'S'];
$cities['610923'] = ['宁陕县', 'N'];
$cities['610924'] = ['紫阳县', 'Z'];
$cities['610925'] = ['岚皋县', 'G'];
$cities['610926'] = ['平利县', 'P'];
$cities['610927'] = ['镇坪县', 'Z'];
$cities['610928'] = ['旬阳县', 'X'];
$cities['610929'] = ['白河县', 'B'];
// 商洛
$cities['611000'] = ['商洛', 'S'];
$cities['611002'] = ['商州区', 'S'];
$cities['611021'] = ['洛南县', 'L'];
$cities['611022'] = ['丹凤县', 'D'];
$cities['611023'] = ['商南县', 'S'];
$cities['611024'] = ['山阳县', 'S'];
$cities['611025'] = ['镇安县', 'Z'];
$cities['611026'] = ['柞水县', 'Z'];
// 陕西省结束
//======================================
// 甘肃省
$cities['620000'] = ['甘肃省', 'G'];
// 兰州
$cities['620100'] = ['兰州', 'L'];
$cities['620102'] = ['城关区', 'C'];
$cities['620103'] = ['七里河区', 'Q'];
$cities['620104'] = ['西固区', 'X'];
$cities['620105'] = ['安宁区', 'A'];
$cities['620111'] = ['红古区', 'H'];
$cities['620121'] = ['永登县', 'Y'];
$cities['620122'] = ['皋兰县', 'G'];
$cities['620123'] = ['榆中县', 'Y'];
// 嘉峪关
$cities['620200'] = ['嘉峪关', 'J'];
// 金昌
$cities['620300'] = ['金昌', 'J'];
$cities['620302'] = ['金川区', 'J'];
$cities['620321'] = ['永昌县', 'Y'];
// 白银
$cities['620400'] = ['白银', 'B'];
$cities['620402'] = ['白银区', 'B'];
$cities['620403'] = ['平川区', 'P'];
$cities['620421'] = ['靖远县', 'J'];
$cities['620422'] = ['会宁县', 'H'];
$cities['620423'] = ['景泰县', 'J'];
// 天水
$cities['620500'] = ['天水', 'T'];
$cities['620502'] = ['秦城区', 'Q'];
$cities['620503'] = ['北道区', 'B'];
$cities['620521'] = ['清水县', 'Q'];
$cities['620522'] = ['秦安县', 'Q'];
$cities['620523'] = ['甘谷县', 'G'];
$cities['620524'] = ['武山县', 'W'];
$cities['620525'] = ['张家川回族自治县', 'Z'];
// 武威
$cities['620600'] = ['武威', 'W'];
$cities['620602'] = ['凉州区', 'L'];
$cities['620621'] = ['民勤县', 'M'];
$cities['620622'] = ['古浪县', 'G'];
$cities['620623'] = ['天祝藏族自治县', 'T'];
// 张掖
$cities['620700'] = ['张掖', 'Z'];
$cities['620702'] = ['甘州区', 'G'];
$cities['620721'] = ['肃南裕固族自治县', 'S'];
$cities['620722'] = ['民乐县', 'M'];
$cities['620723'] = ['临泽县', 'L'];
$cities['620724'] = ['高台县', 'G'];
$cities['620725'] = ['山丹县', 'S'];
// 平凉
$cities['620800'] = ['平凉', 'P'];
$cities['620802'] = ['崆峒区', 'Q'];
$cities['620821'] = ['泾川县', 'C'];
$cities['620822'] = ['灵台县', 'L'];
$cities['620823'] = ['崇信县', 'C'];
$cities['620824'] = ['华亭县', 'H'];
$cities['620825'] = ['庄浪县', 'Z'];
$cities['620826'] = ['静宁县', 'J'];
// 酒泉
$cities['620900'] = ['酒泉', 'J'];
$cities['620902'] = ['肃州区', 'S'];
$cities['620921'] = ['金塔县', 'J'];
$cities['620922'] = ['安西县', 'A'];
$cities['620923'] = ['肃北蒙古族自治县', 'S'];
$cities['620924'] = ['阿克塞哈萨克族自治县', 'A'];
$cities['620981'] = ['玉门市', 'Y'];
$cities['620982'] = ['敦煌市', 'D'];
$cities['620983'] = ['瓜州县', 'G'];
// 庆阳
$cities['621000'] = ['庆阳', 'Q'];
$cities['621002'] = ['西峰区', 'X'];
$cities['621021'] = ['庆城县', 'Q'];
$cities['621022'] = ['环县', 'H'];
$cities['621023'] = ['华池县', 'H'];
$cities['621024'] = ['合水县', 'H'];
$cities['621025'] = ['正宁县', 'Z'];
$cities['621026'] = ['宁县', 'N'];
$cities['621027'] = ['镇原县', 'Z'];
// 定西
$cities['621100'] = ['定西', 'D'];
$cities['621102'] = ['安定区', 'A'];
$cities['621121'] = ['通渭县', 'T'];
$cities['621122'] = ['陇西县', 'L'];
$cities['621123'] = ['渭源县', 'W'];
$cities['621124'] = ['临洮县', 'L'];
$cities['621125'] = ['漳县', 'Z'];
$cities['621126'] = ['岷县', 'X'];
// 陇南
$cities['621200'] = ['陇南', 'L'];
$cities['621202'] = ['武都区', 'W'];
$cities['621221'] = ['成县', 'C'];
$cities['621222'] = ['文县', 'W'];
$cities['621223'] = ['宕昌县', 'C'];
$cities['621224'] = ['康县', 'K'];
$cities['621225'] = ['西和县', 'X'];
$cities['621226'] = ['礼县', 'L'];
$cities['621227'] = ['徽县', 'H'];
$cities['621228'] = ['两当县', 'L'];
// 临夏
$cities['622900'] = ['临夏', 'L'];
$cities['622901'] = ['临夏市', 'L'];
$cities['622921'] = ['临夏县', 'L'];
$cities['622922'] = ['康乐县', 'K'];
$cities['622923'] = ['永靖县', 'Y'];
$cities['622924'] = ['广河县', 'G'];
$cities['622925'] = ['和政县', 'H'];
$cities['622926'] = ['东乡族自治县', 'D'];
$cities['622927'] = ['积石山保安族东乡族撒拉族自治县', 'J'];
// 甘南
$cities['623000'] = ['甘南', 'G'];
$cities['623001'] = ['合作市', 'H'];
$cities['623021'] = ['临潭县', 'L'];
$cities['623022'] = ['卓尼县', 'Z'];
$cities['623023'] = ['舟曲县', 'Z'];
$cities['623024'] = ['迭部县', 'D'];
$cities['623025'] = ['玛曲县', 'M'];
$cities['623026'] = ['碌曲县', 'L'];
$cities['623027'] = ['夏河县', 'X'];
// 甘肃省结束
//======================================
// 青海省
$cities['630000'] = ['青海省', 'Q'];
// 西宁
$cities['630100'] = ['西宁', 'X'];
$cities['630102'] = ['城东区', 'C'];
$cities['630103'] = ['城中区', 'C'];
$cities['630104'] = ['城西区', 'C'];
$cities['630105'] = ['城北区', 'C'];
$cities['630121'] = ['大通回族土族自治县', 'D'];
$cities['630122'] = ['湟中县', 'Z'];
$cities['630123'] = ['湟源县', 'Y'];
// 海东
$cities['632100'] = ['海东', 'H'];
$cities['632121'] = ['平安县', 'P'];
$cities['632122'] = ['民和回族土族自治县', 'M'];
$cities['632123'] = ['乐都县', 'L'];
$cities['632126'] = ['互助土族自治县', 'H'];
$cities['632127'] = ['化隆回族自治县', 'H'];
$cities['632128'] = ['循化撒拉族自治县', 'X'];
// 海北藏族
$cities['632200'] = ['海北藏族', 'H'];
$cities['632221'] = ['门源回族自治县', 'M'];
$cities['632222'] = ['祁连县', 'Q'];
$cities['632223'] = ['海晏县', 'H'];
$cities['632224'] = ['刚察县', 'G'];
// 黄南
$cities['632300'] = ['黄南', 'H'];
$cities['632321'] = ['同仁县', 'T'];
$cities['632322'] = ['尖扎县', 'J'];
$cities['632323'] = ['泽库县', 'Z'];
$cities['632324'] = ['河南蒙古族自治县', 'H'];
// 海南藏族
$cities['632500'] = ['海南藏族', 'H'];
$cities['632521'] = ['共和县', 'G'];
$cities['632522'] = ['同德县', 'T'];
$cities['632523'] = ['贵德县', 'G'];
$cities['632524'] = ['兴海县', 'X'];
$cities['632525'] = ['贵南县', 'G'];
// 果洛
$cities['632600'] = ['果洛', 'G'];
$cities['632621'] = ['玛沁县', 'M'];
$cities['632622'] = ['班玛县', 'B'];
$cities['632623'] = ['甘德县', 'G'];
$cities['632624'] = ['达日县', 'D'];
$cities['632625'] = ['久治县', 'J'];
$cities['632626'] = ['玛多县', 'M'];
// 玉树
$cities['632700'] = ['玉树', 'Y'];
$cities['632721'] = ['玉树县', 'Y'];
$cities['632722'] = ['杂多县', 'Z'];
$cities['632723'] = ['称多县', 'C'];
$cities['632724'] = ['治多县', 'Z'];
$cities['632725'] = ['囊谦县', 'N'];
$cities['632726'] = ['曲麻莱县', 'Q'];
// 海西
$cities['632800'] = ['海西', 'H'];
$cities['632801'] = ['格尔木市', 'G'];
$cities['632802'] = ['德令哈市', 'D'];
$cities['632821'] = ['乌兰县', 'W'];
$cities['632822'] = ['都兰县', 'D'];
$cities['632823'] = ['天峻县', 'T'];
// 青海省结束
//======================================
// 宁夏
$cities['640000'] = ['宁夏', 'N'];
// 银川
$cities['640100'] = ['银川', 'Y'];
$cities['640104'] = ['兴庆区', 'X'];
$cities['640105'] = ['西夏区', 'X'];
$cities['640106'] = ['金凤区', 'J'];
$cities['640121'] = ['永宁县', 'Y'];
$cities['640122'] = ['贺兰县', 'H'];
$cities['640181'] = ['灵武市', 'L'];
// 石嘴山
$cities['640200'] = ['石嘴山', 'S'];
$cities['640202'] = ['大武口区', 'D'];
$cities['640205'] = ['惠农区', 'H'];
$cities['640221'] = ['平罗县', 'P'];
// 吴忠
$cities['640300'] = ['吴忠', 'W'];
$cities['640302'] = ['利通区', 'L'];
$cities['640323'] = ['盐池县', 'Y'];
$cities['640324'] = ['同心县', 'T'];
$cities['640381'] = ['青铜峡市', 'Q'];
// 固原
$cities['640400'] = ['固原', 'G'];
$cities['640402'] = ['原州区', 'Y'];
$cities['640422'] = ['西吉县', 'X'];
$cities['640423'] = ['隆德县', 'L'];
$cities['640424'] = ['泾源县', 'Y'];
$cities['640425'] = ['彭阳县', 'P'];
// 中卫
$cities['640500'] = ['中卫', 'Z'];
$cities['640502'] = ['沙坡头区', 'S'];
$cities['640521'] = ['中宁县', 'Z'];
$cities['640522'] = ['海原县', 'H'];
// 宁夏结束
//======================================
// 新疆
$cities['650000'] = ['新疆', 'X'];
// 乌鲁木齐
$cities['650100'] = ['乌鲁木齐', 'W'];
$cities['650102'] = ['天山区', 'T'];
$cities['650103'] = ['沙依巴克区', 'S'];
$cities['650104'] = ['新市区', 'X'];
$cities['650105'] = ['水磨沟区', 'S'];
$cities['650106'] = ['头屯河区', 'T'];
$cities['650107'] = ['达坂城区', 'D'];
$cities['650108'] = ['东山区', 'D'];
$cities['650121'] = ['乌鲁木齐县', 'W'];
$cities['650109'] = ['米东区', 'M'];
// 克拉玛依
$cities['650200'] = ['克拉玛依', 'K'];
$cities['650202'] = ['独山子区', 'D'];
$cities['650203'] = ['克拉玛依区', 'K'];
$cities['650204'] = ['白碱滩区', 'B'];
$cities['650205'] = ['乌尔禾区', 'W'];
// 吐鲁番
$cities['652100'] = ['吐鲁番', 'T'];
$cities['652101'] = ['吐鲁番市', 'T'];
$cities['652122'] = ['鄯善县', 'S'];
$cities['652123'] = ['托克逊县', 'T'];
// 哈密
$cities['652200'] = ['哈密', 'H'];
$cities['652201'] = ['哈密市', 'H'];
$cities['652222'] = ['巴里坤哈萨克自治县', 'B'];
$cities['652223'] = ['伊吾县', 'Y'];
// 昌吉
$cities['652300'] = ['昌吉', 'C'];
$cities['652301'] = ['昌吉市', 'C'];
$cities['652302'] = ['阜康市', 'F'];
$cities['652303'] = ['米泉市', 'M'];
$cities['652323'] = ['呼图壁县', 'H'];
$cities['652324'] = ['玛纳斯县', 'M'];
$cities['652325'] = ['奇台县', 'Q'];
$cities['652327'] = ['吉木萨尔县', 'J'];
$cities['652328'] = ['木垒哈萨克自治县', 'M'];
// 博尔塔拉
$cities['652700'] = ['博尔塔拉', 'B'];
$cities['652701'] = ['博乐市', 'B'];
$cities['652722'] = ['精河县', 'J'];
$cities['652723'] = ['温泉县', 'W'];
// 巴音郭楞
$cities['652800'] = ['巴音郭楞', 'B'];
$cities['652801'] = ['库尔勒市', 'K'];
$cities['652822'] = ['轮台县', 'L'];
$cities['652823'] = ['尉犁县', 'W'];
$cities['652824'] = ['若羌县', 'R'];
$cities['652825'] = ['且末县', 'Q'];
$cities['652826'] = ['焉耆回族自治县', 'Y'];
$cities['652827'] = ['和静县', 'H'];
$cities['652828'] = ['和硕县', 'H'];
$cities['652829'] = ['博湖县', 'B'];
// 阿克苏
$cities['652900'] = ['阿克苏', 'A'];
$cities['652901'] = ['阿克苏市', 'A'];
$cities['652922'] = ['温宿县', 'W'];
$cities['652923'] = ['库车县', 'K'];
$cities['652924'] = ['沙雅县', 'S'];
$cities['652925'] = ['新和县', 'X'];
$cities['652926'] = ['拜城县', 'B'];
$cities['652927'] = ['乌什县', 'W'];
$cities['652928'] = ['阿瓦提县', 'A'];
$cities['652929'] = ['柯坪县', 'K'];
// 克孜勒苏
$cities['653000'] = ['克孜勒苏', 'K'];
$cities['653001'] = ['阿图什市', 'A'];
$cities['653022'] = ['阿克陶县', 'A'];
$cities['653023'] = ['阿合奇县', 'A'];
$cities['653024'] = ['乌恰县', 'W'];
// 喀什
$cities['653100'] = ['喀什', 'K'];
$cities['653101'] = ['喀什市', 'K'];
$cities['653121'] = ['疏附县', 'S'];
$cities['653122'] = ['疏勒县', 'S'];
$cities['653123'] = ['英吉沙县', 'Y'];
$cities['653124'] = ['泽普县', 'Z'];
$cities['653125'] = ['莎车县', 'S'];
$cities['653126'] = ['叶城县', 'Y'];
$cities['653127'] = ['麦盖提县', 'M'];
$cities['653128'] = ['岳普湖县', 'Y'];
$cities['653129'] = ['伽师县', 'S'];
$cities['653130'] = ['巴楚县', 'B'];
$cities['653131'] = ['塔什库尔干塔吉克自治县', 'T'];
// 和田
$cities['653200'] = ['和田', 'H'];
$cities['653201'] = ['和田市', 'H'];
$cities['653221'] = ['和田县', 'H'];
$cities['653222'] = ['墨玉县', 'M'];
$cities['653223'] = ['皮山县', 'P'];
$cities['653224'] = ['洛浦县', 'L'];
$cities['653225'] = ['策勒县', 'C'];
$cities['653226'] = ['于田县', 'Y'];
$cities['653227'] = ['民丰县', 'M'];
// 伊犁
$cities['654000'] = ['伊犁', 'Y'];
$cities['654002'] = ['伊宁市', 'Y'];
$cities['654003'] = ['奎屯市', 'K'];
$cities['654021'] = ['伊宁县', 'Y'];
$cities['654022'] = ['察布查尔锡伯自治县', 'C'];
$cities['654023'] = ['霍城县', 'H'];
$cities['654024'] = ['巩留县', 'G'];
$cities['654025'] = ['新源县', 'X'];
$cities['654026'] = ['昭苏县', 'Z'];
$cities['654027'] = ['特克斯县', 'T'];
$cities['654028'] = ['尼勒克县', 'N'];
// 塔城
$cities['654200'] = ['塔城', 'T'];
$cities['654201'] = ['塔城市', 'T'];
$cities['654202'] = ['乌苏市', 'W'];
$cities['654221'] = ['额敏县', 'E'];
$cities['654223'] = ['沙湾县', 'S'];
$cities['654224'] = ['托里县', 'T'];
$cities['654225'] = ['裕民县', 'Y'];
$cities['654226'] = ['和布克赛尔蒙古自治县', 'H'];
// 阿勒泰
$cities['654300'] = ['阿勒泰', 'A'];
$cities['654301'] = ['阿勒泰市', 'A'];
$cities['654321'] = ['布尔津县', 'B'];
$cities['654322'] = ['富蕴县', 'F'];
$cities['654323'] = ['福海县', 'F'];
$cities['654324'] = ['哈巴河县', 'H'];
$cities['654325'] = ['青河县', 'Q'];
$cities['654326'] = ['吉木乃县', 'J'];
// 五家渠
$cities['659004'] = ['五家渠', 'W'];
// 新疆结束
//======================================
// 台湾省
$cities['710000'] = ['台湾省', 'T'];
// 台湾省结束
//======================================
// 香港
$cities['810000'] = ['香港', 'X'];
// 香港结束
//======================================
// 澳门
$cities['820000'] = ['澳门', 'A'];
// 澳门结束